{"pageProps":{"title":"A Crime Ace Keeps the Saxon King – Romford Recorder, 14/09/1956 ","contentRichText":"\n<article class=\"article\">\n  <p class=\"govuk-body\">Petersfield Avenue is a quiet pleasant street on Harold Hill LCC estate. Approaching from Gooshays-drive, the park stretches greenly to the left, while small houses line the right-hand side, curving round to the shopping centre. On the hillside opposite the shops stand two small churches, as if in a Swiss village.</p>\n  <p class=\"govuk-body\">It’s the last place you would expect to find a tie-up with Jack Spot and Billy Hill and the vicious underworld of the race gangs, or to find a man with intimate knowledge of vice rings in the squalid area of Soho.</p>\n  <p class=\"govuk-body\">Yet behind the bar of the Saxon King stands a man who knows it all: the rackets and the mobsters, the razor-slashing and the call girls.</p>\n  <p class=\"govuk-body\">Thick-set and ruggedly handsome, he has a determined jaw and shrewd blue eyes that expertly appraise whoever enters the bar’s swing doors. He is the landlord, 43-year-old ex-Det-Sgt. Albert Herron, formerly of the Flying Squad.</p>\n  <p class=\"govuk-body\">Soon after his marriage in 1937 he joined the police, even though his £6 a week pay packet, good in those days, was halved.</p>\n  <p class=\"govuk-body\">The last job he had to do was near Eastern-avenue.</p>\n  <p class=\"govuk-body\">Stolen lorry</p>\n  <p class=\"govuk-body\">Flashed from the Yard on Christmas, 1954, was a message that a lorry containing 13,000 bottles of Scotch had been stolen outside the driver’s home in the Old Kent-road and was heading east.</p>\n  <p class=\"govuk-body\">As the lorry came down Eastern-avenue he and his companions spotted it, and switching off their lights gave chase.</p>\n  <p class=\"govuk-body\">Crouching on the running-board of the squad car was Mr Herron. As they drew alongside he leapt on the lorry while his companions raced ahead and pulled up in front of it.</p>\n  <p class=\"govuk-body\">Too surprised to realise what was happening, the thieves pulled up and in his own words, ‘We had a bit of a scuffle and arrested two of them.’</p>\n  <p class=\"govuk-body\">Eighteen months ago he resigned after 20 years’ service, broken only as a Commando in the war. He resigned for the sake of his attractive wife who was tired of seeing so little of him.</p>\n  <p class=\"govuk-body\">Teddy boys don’t worry him. Many, he says, are real gentlemen, and in his opinion the Edwardian fashion is no worse than the Oxford ‘bags’ of his youth. He’s all for youth, and considers there is nothing basically wrong with them.</p>\n  <p class=\"govuk-body\">One of his ambitions is to start a youth club so that Teddy boys and others will have something worthwhile to go; somewhere with boxing and wrestling to make it into a real club.</p>\n  <p class=\"govuk-body\">Singing, shaving and shampooing in a nearby shop is Mr. Robert Sand – one of Mr. Herron’s regular customers.</p>\n  <p class=\"govuk-body\">But Mr. Sand has held more lethal weapons in his hand than a pair of scissors.</p>\n  <p class=\"govuk-body\">As the first tank-landing craft nosed its way through the sea mist on D-Day on to Normandy beaches, the first to jump ashore was a short, compact man with a dark moustache, Sgt Robert Sand of the Intelligence Corps, now a hairdresser at 114, Petersfield-avenue, Harold Hill.</p>\n  <p class=\"govuk-body\">Before the campaign was over he was promoted in the field to staff-captain.</p>\n  <p class=\"govuk-body\">Number up</p>\n  <p class=\"govuk-body\">His number was nearly up even before they landed, for as they approached the beaches there was an ominous bumping as they passed over the mine. Fortunately, it didn’t go off, and he lived to have two more narrow escapes.</p>\n  <p class=\"govuk-body\">The first was when, well advanced and creeping cautiously through the dark, he heard a pop like that of a champagne cork. Into his mind flashed his instructor’s warning:</p>\n  <p class=\"govuk-body\">‘The German shoe mine gives a sound like a champagne cork going off if you step on it. The only thing you can do is to keep your foot down. That way you only lose a leg. Otherwise you’ll most certainly be killed.’</p>\n  <p class=\"govuk-body\">Seconds passed, each longer than the other. Nothing happened. After thirty seconds that seemed like a lifetime he knew he was safe.</p>\n  <p class=\"govuk-body\">For generations, his family, starting in his father’s native Poland, have been hairdressers. He carries on a long tradition of craftsmanship.</p>\n  <p class=\"govuk-body\">Mr. Sand was lucky in his choice of a wife, whom he met in a Dagenham social club. She helped his business at Ilford, but now spends most of her time at their home with her 12-year-old daughter, Beverley – and learning French.</p>\n  <p class=\"govuk-body\">The lack of entertainment and recreational facilities is a serious problem in Harold Hill, says Mr. Sand, who considers that many women on the estate are becoming neurotic through the lack of interest in anything outside their own homes.</p>\n  <p class=\"govuk-body\">At No. 87, Mr. Edward Ward is not so sure about this. He sees little of the estate. For six and a half years he has left for his job in a Greenwich sheet-metal works at 5 a.m., worked a 12-hour day, and returned at 8.30 p.m. to eat, wash and go to bed.</p>\n  <p class=\"govuk-body\">Among those who have tried to buck things up on the estate are Mr. and Mrs. Robert Turner at No. 137.</p>\n  <p class=\"govuk-body\">They started a motor-cycle club, and for some time they spent enjoyable Sundays chasing round the countryside on treasure hunts with their motor-cycle and sidecar.</p>\n  <p class=\"govuk-body\">Now at Fords, Dagenham, Mr. Turner, hit by short-time working, and being a smart chap, has got himself a job as part-time driver on a coal lorry.</p>\n  <p class=\"govuk-body\">He and his wife won first prize for the best garden of newcomers to the road this summer, and sixth prize for the best autumn garden.</p>\n  <p class=\"govuk-body\">Petersfield-avenue has its own social club. Secretary Mr. Stephen Foster lives at No. 225.</p>\n  <p class=\"govuk-body\">Travel grouse</p>\n  <p class=\"govuk-body\">Mr. Foster’s 17-year-old daughter, Joan, likes Harold Hill, but gets fed up with travelling to Romford or Brentwood to dance or visit a cinema.</p>\n  <p class=\"govuk-body\">But Mrs. Florence Foster would not move from the estate. Neither would Stephen.</p>\n  <p class=\"govuk-body\">‘I like my school and I like my mates,’ he said, and impish grin spreading across his cherubic face.</p>\n  <p class=\"govuk-body\">Mrs. Catherine Roberts, of 4, Brackley House, asks why estate schools will not take children before they are five. She has two children – Lawrence, four, and Lorraine, two next month. Her husband is a docker.</p>\n  <p class=\"govuk-body\">Mr. and Mrs. Joan Landridge moved to No. 250 from a Straight-road prefab six years ago. They like their neighbours and complain of high prices. My wife shops in Romford two days a week and saves 6s. on groceries alone, said Mr. Langridge.</p>\n  <p class=\"govuk-body\">They have four children – Johnny (12), Frances (10), Gloria (7) and Susan (2). Frances likes to intimate Max Wall. ‘She has us in fits of laughter when she does her walk and her own version of rock’n’roll,’ said her mother.</p>\n  <p class=\"govuk-body\">At No. 68 lives a man to whom climbing 300-foot towers is as easy as falling off a ladder. He is 31-year-old Mr. John White who says: ‘I’ve fallen off more ladders than I care to remember.’</p>\n  <p class=\"govuk-body\">A paint sprayer with a London firm, he recently painted the outside of the window frames at Senate House, a high building at London University. He also spent months decorating the Royal Festival Hall.</p>\n</article>\n","id":"4y3vTUUCGqa2hijnswZU4p"},"__N_SSG":true}