{"pageProps":{"title":"British Youth Ruled the World","contentRichText":"\n<p class=\"govuk-body\">A unique aspect of UK youth is its love affair with music. Styles that have moved around the world were picked up by British youth first. If British teenagers were dancing to the reggae rhythm in the late 1960s then, apart from in its West Indian homeland, nobody else was – it wasn’t until the 1990s that reggae in any form found popular success in the United States. Likewise, decades later, obscure forms of music such as house and techno were taken from small clubs in Chicago and Detroit, adapted to fit the British scene, and then resold to the world, at which point they became global phenomena – in much the same way as the Rolling Stones and others adapted and then sold back the blues to an American audience in the 1960s and ’70s.</p>\n<p class=\"govuk-body\">From the mid-1950s to the mid-1980s, a succession of youth movements were embraced by generations of youngsters – there has not been an era for youth like it before or since.</p>\n<p class=\"govuk-body\">The 1950s Teds were followed by the 1960s mods and rockers, which led into hippies and skinheads, and then, in the late 1970s, punks, rude boys and revivals of all that had come before. All had their own distinct style of dress and music, with associated degrees of violence and drug-taking.</p>\n<p class=\"govuk-body\">These youth movements became, for those involved, obsessive ways of life that would take up all spare time and wages. Interest usually started at age 15 or 16 and would continue until their early 20s when commitment to work and interest in girls became a bigger priority. Marriage then very rarely happened after the age of 21, so there was an adolescence gap before the expected obligation.</p>\n<p class=\"govuk-body\">For the first time in modern history, the youth had relative freedom – both financially and morally. There was a gap – the teenage gap – between leaving school and adult responsibility, and they would find themselves working but living at home with parents, so they had money to spend.</p>\n<h2 class=\"govuk-heading-m\">London was the epicentre</h2>\n<p class=\"govuk-body\">At the centre of this youth explosion – both nationally and, at various times, internationally – was London: it was from here that many new styles and tastes developed and grew. This was partly down to the white youth who embraced modernity with relish, but also down to the influence of groups such as the Jewish lads, Italians and West Indians who were living and settled in the capital.</p>\n<p class=\"govuk-body\">Harold Hill was a part of London – the ties between the two areas were strong. Many young people still had friends and family living further into London, and others worked or went to college closer to the centre, while many enjoyed regular nights out in the West End. The cross-over of ideas and tastes was a continuous process.</p>\n","id":"19XQTfGVQueLuMPrHzNGce"},"__N_SSG":true}