{"pageProps":{"title":"Do You Know People Who Live – Down Your Street? – Romford Recorder, 30/09/1956","contentRichText":"\n<article class=\"article\">\n  <p class=\"govuk-body\">You see them passing the window, the women with shopping bags in hand, the dog bounding at their heels and the children bouncing a gaily-coloured ball. They may be the people next door who have the trim garden, the demurely-curtained windows and a television aerial, similar to so many others down your street.</p>\n  <p class=\"govuk-body\">But behind the curtains they live an interesting life.</p>\n  <p class=\"govuk-body\">Cheerful indomitable Jenny Jones lives at 117, Max Vandvenberg, a soft-spoken Dutchman, has that semi-detached, number 44.</p>\n  <p class=\"govuk-body\">The woman clasping her dog in a friendly embrace is Mrs. C. Walton of number 156.</p>\n  <p class=\"govuk-body\">These are but a few of the folk in Chippenham-road, Harold Hill – a street whose counterpart can be found on many of the housing estates round the town.</p>\n  <p class=\"govuk-body\">New and strange</p>\n  <p class=\"govuk-body\">Each tenant has his own problem: each his joy. And each is learning how to settle in as a member of a corporate community in new and often strange surroundings.</p>\n  <p class=\"govuk-body\">Here is the story of 69-year-old Jenny Jones, the friend of everybody in the street.</p>\n  <p class=\"govuk-body\">Jenny confesses that when she first came to Harold Hill she was disappointed. She had set her heart on living on the LCC estate at Debden.</p>\n  <p class=\"govuk-body\">‘But now I am grateful,’ she says. ‘I like Harold Hill and have never been so healthy in my life – and I definitely don’t feel my age.’</p>\n  <p class=\"govuk-body\">Mounting a bicycle for the first time at 40, Jenny has since travelled up and down the country, sleeping under hedges, in haystacks and barns.</p>\n  <p class=\"govuk-body\">The most recent long-distance trip was clouded in mystery. Returning from a tour of Cornwall last summer, Jenny recalls cycling along the Dorchester-road. Next thing she remembered was a nurse bending over her asking: ‘What happened?’</p>\n  <p class=\"govuk-body\">‘You tell me,’ replied Jenny and calmly went to sleep again. She was in hospital for three – and still does not know what happened. ‘It is horrible having a gap in your life,’ she said.</p>\n  <p class=\"govuk-body\">Daily adventure</p>\n  <p class=\"govuk-body\">Her philosophy? Take an interest in everything and everybody and accept every day as a new adventure.</p>\n  <p class=\"govuk-body\">When she lived in Tottenham and Islington during the war she refused to use the air raid shelters. ‘The snoring of people was deafening and if I was going to die I wanted to do it in the comfort of my own bed,’ she said.</p>\n  <p class=\"govuk-body\">Each Wednesday she packs her little case and goes to London to help prepare a monthly Christian magazine. She regularly attends the Taunton-road, McCullough Baptist Church and is an executive member of the estate’s Horticultural Society.</p>\n  <p class=\"govuk-body\">She was also secretary to an old folks club for three years and often takes charge when the regular warden goes on holiday. She likes knitting, cooking and reading, especially Agatha Christie.</p>\n  <p class=\"govuk-body\">Over her fireplace is a picture of a moonlit beach with waves lapping lazily over the sand. This revives many happy memories of Jenny’s 32 years’ service as a clerk in the London Swiss Bank, for the picture was presented to her in 1922 by girl friends who worked with her.</p>\n  <p class=\"govuk-body\">And now Jenny has a typewriter. ‘One of these days,’ she said, ‘I intend writing a novel based on my experiences in the bank.’</p>\n  <p class=\"govuk-body\">Book project</p>\n  <p class=\"govuk-body\">When will Jenny start on the book? ‘When I find the time,’ said this ageless woman with a mischievous gleam in her eyes.</p>\n  <p class=\"govuk-body\">Near enough to Jenny resides tall Max Vanderberg, who has led a much less sheltered life than she has.</p>\n  <p class=\"govuk-body\">Adolph Hitler’s reign of terror over occupied Europe is still a vivid memory to Max, who came to Harold Hill over two years ago.</p>\n  <p class=\"govuk-body\">As Marion, his dark-haired English wife knitted busily at the fireside of their bright, comfortable home, Max talked of his job as manager of a radio and television shop at Hilldene-avenue, of his passion for languages – he speaks five – his dislike of gardening and of the unpredictable English weather.</p>\n  <p class=\"govuk-body\">He spoke approvingly of the demand for TV sets, regretfully of the petrol rationing which limits his family’s car outings, and proudly of his 23-month-old baby daughter, Yvonne.</p>\n  <p class=\"govuk-body\">But of life under Nazi domination he preferred to remain silent. ‘People aren’t interested after all this time,’ he said.</p>\n  <p class=\"govuk-body\">Under Hitler</p>\n  <p class=\"govuk-body\">Before the five fateful days in which Hitler’s jackbooted armies overran an unprepared Holland, Max Vandenberg was the principal shareholder of a flourishing film distribution company in Amsterdam.</p>\n  <p class=\"govuk-body\">Then war struck his country. ‘I did not fancy spending my holidays in a concentration camp,’ he said with a grin, ‘so I went on the run.’</p>\n  <p class=\"govuk-body\">That was a nightmare existence of near-starvation and never-ending battle of wits with the dreaded Gestapo. Caught several times, he always managed to escape. After wriggling through the Gestapo network, he arrived in Germany.</p>\n  <p class=\"govuk-body\">A night raid by allied bombers helped him to secure a new identity after a town had been blitzed.</p>\n  <p class=\"govuk-body\">Brazenly he went to the authorities and told them he had lost everything in the raid. The Germans kindly provided him with ‘new’ papers, money and a job!</p>\n  <p class=\"govuk-body\">From there Max travelled to Lake Constance, which borders Germany, Austria and Switzerland, and after many disappointments successfully escaped.</p>\n  <p class=\"govuk-body\">Footballer</p>\n  <p class=\"govuk-body\">Among those proud to know Max is 25-year-old singing footballer, Roy Merrifield, who lives with his mother at No. 39, and who recently appeared on ITV in the nation-wide Palais Party singing contest.</p>\n  <p class=\"govuk-body\">Oddly enough, it was football that led to the discovery of Roy’s talent as a singer. He was talked into making a recording which was played at Chelsea Football Club. Radio disc jockey, George Elrick, was impressed and fixed an audition with orchestra leader, Mantovant. But Mantovant unfortunately wanted a crooner with a new gimmick.</p>\n  <p class=\"govuk-body\">Roy wasn’t too disappointed. ‘I don’t want singing to interfere with my professional football career,’ he said.</p>\n  <p class=\"govuk-body\">Roy started his soccer career as a schoolboy in Ealing. After a spell on Brentford’s ground staff, at 16 he was one of the youngest-ever players to gain a first team place with Isthmian League club Barking. During his two years National Service in the Army, he was the only amateur in an Army touring side, which included present international stars John Charles, Tommy Taylor and John Anderson.</p>\n  <p class=\"govuk-body\">When he was demobbed, this brilliant young winger joined local Delphin League club, Rainham Town.</p>\n  <p class=\"govuk-body\">Transferred from Chelsea to Millwall this season, Roy says: ‘During my 2 ½ years with Rainham Crom Bailey, the coach gave me more help and encouragement than anyone. Whatever success I may achieve will largely be due to him.’</p>\n  <p class=\"govuk-body\">The story of Mrs. Cecilia Walton, of No. 156, is of a courageous and uncomplaining battle against ill-health. A tuberculosis sufferer when she and her husband, Ralph, moved to the estate from London six years ago, Mrs Walton spent four years seriously ill in bed.</p>\n  <p class=\"govuk-body\">She is one of a band of Good Samaritans, who organised a club on the estate for the physically handicapped, at the Dagenham Park-drive Methodist Church Hall.</p>\n  <p class=\"govuk-body\">Mr. Walton, a BBC lighting technician and a Japanese POW for three years, helps by using his car as an ambulance for sitting cases.</p>\n  <p class=\"govuk-body\">First to greet us when we called on the Walton family was Tiny, a loveable, shaggy-haired mongrel bitch. Mrs Walton found her frozen as a pup, and brought her back to life by wrapping her in the oven to thaw out.</p>\n  <p class=\"govuk-body\">Regular churchgoers, the Waltons like Harold Hill: ‘I have never had so many friends. It is wonderful how people will help each other.’ And these are but a few of the neighbours you can read about in ‘Down Your Street’.</p>\n</article>\n","id":"3TUa8JlJ98hMIbdpZ9AEpK"},"__N_SSG":true}