{"pageProps":{"title":"Ebenezer Howard and the Garden City Movement","contentRichText":"\n<h2 class=\"govuk-heading-m\">Ebenezer Howard</h2>\n<p class=\"govuk-body\">Later in the 19th century would come a continuation of experiments in right planning and design: garden cities, as envisaged and promoted by Ebenezer Howard.</p>\n<p class=\"govuk-body\">Writing in his seminal work, Garden Cities of To-Morrow, he outlined the three options facing the British population under the title ‘The Three Magnets’, each of which was pulling ‘The People’ in a different direction.</p>\n<p class=\"govuk-body\">The countryside offered lack of society, beauty of nature, hands out of work, land lying idle, wood, meadow, forest, long hours, low wages, fresh air, low rents, lack of drainage, an abundance of water, lack of amusement, bright sunshine, no public spirit, need for reform, crowded dwellings and deserted villages.</p>\n<p class=\"govuk-body\">The town, on the other hand, offered the closing out of nature, social opportunity, isolation of crowds, places of amusement, distance from work, high-money wages, high rents and prices, excessive hours, an army of unemployment, fogs and droughts, costly drainage, foul air, murky sky, well-lit streets and slums and gin palaces.</p>\n<p class=\"govuk-body\">For Howard, the two had to be brought together as town and country that would then offer beauty of nature, social opportunity, fields and parks of easy access, low rents, high wages, low rates, plenty to do, low prices, no sweating, field of enterprise, flow of capital, pure air and water, good drainage, bright homes and gardens, no smoke, no slums, freedom and co-operation.</p>\n<p class=\"govuk-body\">He declared: ‘Town and country must be married, and out of this joyous union will spring a new hope, a new life, a new civilisation.’</p>\n<h3 class=\"govuk-heading-m\">Letchworth and Welwyn Garden City</h3>\n<p class=\"govuk-body\">Building upon the attention gained by his book, the Garden Cities Association (GCA) was formed in May 1900. Following that, two conferences were held, at locations that weren’t coincidental: at Bournville in 1901 and Port Sunlight in July 1902.</p>\n<p class=\"govuk-body\">These existing developments were used by the GCA as practical economic examples that gave credence to their own proposals.</p>\n<p class=\"govuk-body\">This led to the First Garden City Ltd being registered on 1 September 1903.</p>\n<p class=\"govuk-body\">Letchworth was the first town to be built, the plans for which were based on a population of 30,000 living in an area of 1,250 acres, with 2,500 acres of rural green belt surrounding the residential properties. After the First World War came Welwyn Garden City. Perversely, although these towns inspired a whole generation of architects and social planners, they were also to arouse private developers who, between the world wars, built uniform mimic suburbs – such as Upminster – that were a travesty of Howard’s vision.</p>\n","id":"H1Omej68TZxpk9JFIhmWQ"},"__N_SSG":true}