{"pageProps":{"title":"‘First’ of L.C.C. Estate Settlers – Meet the Newmans of Magnolia Close – Romford Times, 16 July 1947  ","contentRichText":"\n<article class=\"article\">\n  <p class=\"govuk-body\">Here is an invitation to accompany me on a visit to the Newmans, of Magnolia-close, Romford. Before you retort that there is no such road as Magnolia-close in Romford, let me explain that the roadway and pavements of Magnolia-close are only in the process of being laid down and that its twenty or so prefabs have been erected no more than three weeks.</p>\n  <p class=\"govuk-body\">It is the first street of the L.C.C. new estate, built on the Green Belt at Dagnam Park and there are already 40 to 50 families settled on the estate, and fresh families, most of whom are leaving London’s overcrowded East End, are moving into the neat, picturesque rows of prefabs every day.</p>\n  <p class=\"govuk-body\">Magnolia-close and Tulip close are being built in the fields bordering the east side of Straight-road, Romford, as fast as the bull-dozers and host of builders – many of the labourers are German P.O.W.s – can work.</p>\n  <p class=\"govuk-body\">But Risk It!</p>\n  <p class=\"govuk-body\">As we enter the estate, a grim sounding notice warns us ‘all unauthorised persons entering the estate do so at their own risk.’ But don’t be put off by that, it is only a warning to watch out for the innumerable builder’s lorries which drive in and out.</p>\n  <p class=\"govuk-body\">On the door-step of her prefab we meet Mrs. H. Newman. Young, attractive Mrs. Newman, with her husband and her babies, has been living in her prefab for two weeks. They came from Hampstead, where they lived in one room with Mrs. Newman’s parents. Mrs. Newman is full of enthusiasm for her new home.</p>\n  <p class=\"govuk-body\">She wants to show us the two bedrooms and her all-electric kitchen with its refrigerator.</p>\n  <p class=\"govuk-body\">‘I am forever making ice-cream for the children,’ she says. She agrees at the moment, Magnolia-close does not look very attractive with the roads uncompleted and all the builders’ activity, but she is confident that when the lawns are laid out and the gardens tended, it will be a garden estate.</p>\n  <p class=\"govuk-body\">Romford Has Its Points</p>\n  <p class=\"govuk-body\">All-in-all, Mrs Newman considers that the advantages of Romford outweigh the disadvantages. She has to take a 21/2d. bus ride to do her shopping now and Mr. Newman has to get up much earlier in the morning – not to mention travelling on the L.N.E.R. – to reach Smithfield Market where he works. He considers these small discomforts, however, for his own home and garden.</p>\n  <p class=\"govuk-body\">Postscript. – Immediate ambition of Mrs. Newman as soon as she has settled down is to take a country walk to Noak Hill.</p>\n</article>\n","id":"FJpTRLTd9V2pwAHpoVRZV"},"__N_SSG":true}