{"pageProps":{"title":"The Greater London Plan, 1944 – the ‘Abercrombie Plan’","contentRichText":"\n<h2 class=\"govuk-heading-m\">The Labour Party</h2>\n<p class=\"govuk-body\">World War Two was closing upon the publication of Abercrombie’s second work, but the beginning of peacetime in 1945 would allow the gates to open for widespread social reorganisation. The pivotal catalyst was the election of the Labour government in 1945.</p>\n<p class=\"govuk-body\">Before the war’s end, the Labour Party, along with many other political and pressure groups, issued pamphlets detailing their future housing policy. Although Your Home Planned by Labour was aimed at all working-class people, reflecting the times, the introduction is targeted at housewives seeking a better kitchen:</p>\n<p class=\"govuk-body\">‘For every woman in Britain today who is pleased with her kitchen, there are several who want – and urgently need – a better kitchen. Labour’s post-war policy has remembered the fact that your kitchen is the core of your home, your workshop, where you spend much of your time, out of which come the good meals and the clean linen which help to make yours a truly happy household.’</p>\n<p class=\"govuk-body\">Near the end of Your Home Planned by Labour, the text reads:</p>\n<p class=\"govuk-body\">‘These are the stately homes of England!</p>\n<p class=\"govuk-body\">In ugly huddles of brick and mortar like this, millions of our people must spend their lives. These are the cramped and dangerous playgrounds of our children. These are the homes where the wallpaper turns musty and peels away from the wall. These are the homes where the women must wage an unceasing battle with dust and drains and grime…</p>\n<p class=\"govuk-body\">These are the homes of the people whose courage and determination made Britain an unconquerable fortress during the grimmest days in our history. Out of these streets came the men and women to fill our fighting forces. Out of these streets came workers, in their millions, to make weapons which safeguarded the future of mankind.</p>\n<p class=\"govuk-body\">The courage, the skill and the determination of the people from the mean streets have made the greatest epic in the long course of human history.</p>\n<p class=\"govuk-body\">The Labour Party insists that the reward of victory shall be a country more worthy of our people. The men and women who have fought and toiled to make victory possible must not live out their lives in cramped and ugly streets. Children shall not be denied sunlight – or opportunity. Women must be released from endless drudgery of tenement and slum.</p>\n<p class=\"govuk-body\">Labour means to get new houses for the British people. Modern. Sunlit. Labour-saving.’</p>\n<h3 class=\"govuk-heading-m\">Frederic J. Osborn, Lewis Silkin and Lord Reith</h3>\n<p class=\"govuk-body\">Although much of the successful post-war social planning rested on the shoulders of the Labour government, efforts were being made almost from the outbreak of war to ensure that peace would also bring prosperity to the masses.</p>\n<p class=\"govuk-body\">In 1940 – when the winner of the war was far from decided – outstanding notables such as Frederic J. Osborn found themselves at the heart of Whitehall arguing the case for radical efforts to tackle Britain’s housing problems. Osborn was then the Honorary Secretary of the Town and Country Planning Association – Howard’s direct descendant – and submitted evidence on its behalf to the Barlow Royal Commission on the Distribution of the Industrial Population.</p>\n<p class=\"govuk-body\">Through diligent work, Osborn was instrumental in persuading the participants in the Barlow Commission to come down forcefully on the side of a redistribution of the urban population, but even this wasn’t radical enough for some and led to a Minority Report, signed by Patrick Abercrombie himself, which called for more centralised powers by the national government to deal with the problem.</p>\n<p class=\"govuk-body\">This concentrated and prolonged lobbying was a product of the widely viewed failure to capitalise on the possibilities presented after the First World War. The cry ‘Never Again!’ was taken up by both the people and professionals, and, within Whitehall, both Lewis Silkin (the new Labour Minister of Town and Country Planning) and Lord Reith (the chairman of the Ministry’s Advisory Committee) played fundamental roles, which led to the New Towns Act (1946) and the Town and Country Planning Act (1947).</p>\n","id":"5DSG67h8CLjf7GFcFd2jON"},"__N_SSG":true}