{"pageProps":{"title":"L.C.C. Reports on Mammoth Romford Estate – Romford Times, 10 October 1945","contentRichText":"\n<article class=\"article\">\n  <p class=\"govuk-body\">A detailed report regarding the estate of approximately 10,000 houses which the London County Council proposed to erect in Romford came before a L.C.C. meeting yesterday afternoon. It bore out very fully all the main points given in the Romford Times’ revelation of three weeks ago – a revelation that caused peculiar and extraordinary consternation to Romford Council members, some of whom accused us of doing ‘a great public disservice’ and ‘abusing privacy’.</p>\n  <p class=\"govuk-body\">The estate area runs along Straight-road from Gallows Corner to Noak Hill-road and across county by Paine’s Brook, emerging on the main road nearly opposite Avenue-road, Harold Wood, and back to Gallows Corner.</p>\n  <p class=\"govuk-body\">Exact acreage was given yesterday as 1,481. Cottage development, ancillary amenities and light industries are suggested, and approval is sought for £250,000 in respect of its acquisition and partial development.</p>\n  <p class=\"govuk-body\">Here, in full, is the report of the L.C.C. Housing and Public Health Committee on the estate</p>\n  <p class=\"govuk-body\">‘Our attention has been drawn to a site, about 1,481 acres in extent, at Dagnams Park, in the Borough of Romford, about 16 miles from Charing Cross, which, in our opinion, is suitable for cottage development, with appropriate amenities.</p>\n  <p class=\"govuk-body\">The land is largely pasture in character, and western section can be drained into an existing outfall sewer. Eastern section cannot be developed until a new drainage scheme for the Hornchurch district, at present under consideration, has been completed.</p>\n  <p class=\"govuk-body\">About 76 acres on western side should, we consider, be secured for erection of emergency factory-made houses under Housing (Temporary Accommodation) Act, 1945, and we propose to seek authority to purchase under that Act.</p>\n  <p class=\"govuk-body\">The existing and future industrial development in Romford district will, no doubt, afford opportunities for local employment, and it may be that part of the site could with advantage, subject to town planning approval, be utilised for light industry.</p>\n  <p class=\"govuk-body\">With the exception of a small area at the south-western corner of the site which is scheduled under the local town planning scheme for residential development of 12 houses to the acre, use of greater part of the land is temporarily restricted pending making of a general interim development order.</p>\n  <p class=\"govuk-body\">It is desirable for the Council to be in a position to proceed, if necessary, by means of a general interim development order.</p>\n  <p class=\"govuk-body\">It is desirable for the Council to be in a position, if necessary, by means of a compulsory order under Part V. of the Housing Act, 1936, except as regards the 76 acres proposed to be used for the erection of emergency factory-made houses. We submit a token estimate to include not only the cost of acquisition but also of partial development of the site. Any expenditure likely to be incurred in the current financial year can be met at a draft on composite capital vote.</p>\n  <p class=\"govuk-body\">We recommend: –</p>\n  <p class=\"govuk-body\">(a) The estimate of 2,834 of liability on capital account of £250,000 submitted by the Finance Committee under the statute in respect of acquisition and partial development for housing purposes of the site at Dagnams Park be approved.</p>\n  <p class=\"govuk-body\">(b) That, in pursuance of provisions of Part V. of the Housing Act, 1936, of a compulsory purchase order so as may be necessary be made for acquisition of the site at Dagnam Park, and that the order be submitted to the Minister of Health for confirmation.’</p>\n  <p class=\"govuk-body\">Intriguing Comparison</p>\n  <p class=\"govuk-body\">It is interesting to compare the embryo scheme for Romford with the more advanced plans for the seemingly similar but much smaller estate scheduled for Loughton.</p>\n  <p class=\"govuk-body\">There the average acquired is 576, which means that the Romford acreage (1,481) is approximately two and a half times greater. Total number of dwellings foreseen for Loughton is 3,830, which on the two and a half times acreage basis gives Romford its anticipated 10,000.</p>\n  <p class=\"govuk-body\">Still assuming the same reckoning, the Dagnams Park project should ultimately contain approximately 10 churches, 150 shops, three cinemas and five pubs, 12 senior and 15 junior schools.</p>\n</article>\n","id":"7xKynEwPCzsJOdxwjCb2aq"},"__N_SSG":true}