{"pageProps":{"title":"Teddy Boys: New Suits and New Songs","contentRichText":"\n<p class=\"govuk-body\">Up until the late 1940s, teenagers would commonly be written ‘teen-agers’ in the press, with the inverted commas implying that their existence was refutable or just fantasy. By the 1950s, however, the reality of teenagers was indisputable.</p>\n<p class=\"govuk-body\">Musical matters really took off with the arrival of rock’n’roll. Swing died out with the wartime GI, and from then until the mid-1950s there were merely vocalists – sardonically labelled crooners – singing whimsical slow ballads that were impossible to dance to. The authorities frigidly enforced social restraint in this period. Songs that were obviously harmless found themselves banned by the BBC. The theme to the acclaimed film The Man with the Golden Arm was prescribed – although the film was concerned with heroin addiction, the song itself was a jazz instrumental; ‘I Want You To Be My Baby’ was not allowed to be broadcast because of the line ‘come upstairs and have some loving’; while Johnnie Ray’s 1954 hit, ‘Such A Night’, was excluded from the BBC’s playlist because of grunts in the chorus. Unsurprisingly, when rock’n’roll hit this milieu it provoked a strong reaction.</p>\n<p class=\"govuk-body\">The music itself was a myriad of styles fused together, as described by American DJ Alan Freed:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘Rock’n’Roll is really swing with a modern name. It began on the levees and plantations, took in folk songs, and features blues and rhythm. It’s the rhythm that gets the kids – they’re starved of music they can dance to, after all those years of crooners.’</p>\n</blockquote>\n<p class=\"govuk-body\">The dam broke at the beginning of 1955, with Bill Haley &#x26; the Comets launching into the singles chart’s top spot with ‘Rock Around the Clock’. The single would go on to sell one million copies in the UK alone. In Haley’s wake came Little Richard, Jerry Lee Lewis, Buddy Holly, Gene Vincent and a certain 20-year-old from Memphis, Tennessee, called Elvis Presley.</p>\n<p class=\"govuk-body\">In their home country of America, the reaction was severe. In Alabama, the spokesman for the White Citizens Council was quoted as saying, ‘Rock’n’Roll is a means of pulling down the white man to the level of the Negro. It is part of a plot to undermine the morals of the youth of our nation.’ In Florida, the Miami Board of Review amusingly condemned the music because it inspired fans to leave their seats and dance in the aisles.</p>\n<p class=\"govuk-body\">In Britain, the reaction to Bill Haley was also startling. The film Rock Around the Clock was the first introduction of this popular style to thousands of teenagers, and they filled up the auditoriums for show after show. At certain places there were reports of rampaging teenagers wrecking the cinemas, which in turn prompted a newspaper frenzy whose sensationalism was out of proportion to the violence that had occurred. Various local authorities responded by banning the film altogether.</p>\n<p class=\"govuk-body\">Sir Malcolm Sargent, the darling of the Home Counties and Prom conductor, said the music was ‘nothing more than primitive Tom-Tom thumping. The amazing thing about rock’n’roll is that youngsters who go into such ecstasies sincerely believe that there is something new or wonderful about it. Rock’n’Roll has been played in the jungle for centuries. Frankly, I think if rock’n’roll is capable of inciting youngsters to riot then it is obviously bad.’</p>\n<p class=\"govuk-body\">If Sargent was bemused by its appeal, then its attraction to the young can be summed up in John Lennon’s famous quip: ‘Rock’n’roll was real, everything else was unreal.’</p>\n<p class=\"govuk-body\">With the new reality came the Teddy boys, or Teds. Their dress style was both exotic and original. Their clothing was based around the long Edwardian jacket, from which came the term ‘Ted’ (that being the diminutive of Edward). They wore narrow ties – or more commonly just a shoestring – under their collars, their trousers were drain pipes, and for shoes they wore ‘brothel-creepers’ with cork soles. Their hair was always greased and shaped into various styles, such as the silver-dollar, the square-neck and, the most outlandish of them all, the duck’s arse, which was a quiff so large it resembled a gigantic wave riding upon their heads. For those old enough sideburns were regulation, while a hat, if worn, would be the striped ratter or cheesecutter cap.</p>\n<p class=\"govuk-body\">They were young, streetwise and working class, and for a couple of years at the centre of infamy and public fear.</p>\n<p class=\"govuk-body\">The Teddy boys in Romford made their first appearance in 1954. In May of that year, Chief Inspector Victor Cook, head of Romford CID, said the following about their presence:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘At the very first sign of the Teddy Boys banding together we are going to step in. And believe me, we will smash up their gangs quicker than they were ever formed.</p>\n  <p class=\"govuk-body\">These Edwardians are all right on their own – they’re cowards at heart – but it’s a different thing when they get together.</p>\n  <p class=\"govuk-body\">That’s when the trouble starts and that’s when we start to take action. We will not have Romford terrorised by them as is happening in some other towns.</p>\n  <p class=\"govuk-body\">It’s no good looking for them in the morning. They don’t get up until late in the day. They don’t go to work – they’re too lazy – and they do their best to dodge National Service.</p>\n  <p class=\"govuk-body\">In the snack bars they buy their breakfast-cum-dinner. To a Teddy Boy that means a cup of tea and beans on toast.</p>\n  <p class=\"govuk-body\">They meet their mates in the early afternoon and then start their beat. It stretches from Romford railway station to the High Street and from there to the Vogue cinema – if it’s Sundays, as far as Raphael Park.’</p>\n</blockquote>\n<p class=\"govuk-body\">In the next edition of the local paper, the Teds responded to this declaration of war:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘It’s not true what people like the detective say about us. In Romford, the Teddy Boys are just ordinary working-class lads. We earn our money and we spend it the way we like – on clothes. To say we stay in bed all morning is plain silly.’</p>\n</blockquote>\n<p class=\"govuk-body\">A Romford Times reporter went out to meet the Teds in their local cafe:</p>\n<p class=\"govuk-body\">‘There was fair-haired David Browning, of 19 Eddy Close, Romford. He wore a pale blue suit with mole-grey velvet at the collar and a fancy waistcoat with wide revers. His trousers, also pale blue, tapered to the ankle. His hair was long. It swept back, curling at the nape of his neck. He was showing a snapshot to Robert Peacock, of Romford, who wore a grey suit with a diagonal pattern, red waistcoat and a Slim Jim tie.</p>\n<p class=\"govuk-body\">We got talking about their clothes. Some of their pals came over and joined us.</p>\n<p class=\"govuk-body\">Robert Lazer, of 7 Farrance Road, Chadwell Heath, was the best dressed by their standards. His suit – grey, with black velvet trimmings – cost him £18 from a South Street tailors.</p>\n<p class=\"govuk-body\">“This isn’t my best. That’s at home. That really is worth seeing,” he said. Asked why they wore Edwardian outfits – “Because we like them, that’s why,” they said. “We look smart and the girls like us this way. We go dancing a lot and if you haven’t a touch of the Edwardian about you, they just don’t give you a glance.</p>\n<p class=\"govuk-body\">“Other people just look dull. We want to be different and wear bright clothes. They suit us and they are the latest thing in fashion.”</p>\n<p class=\"govuk-body\">Are they thugs? Robert Peacock laughed at the idea. “Look,” he said, “do you think that I go about with a knife strapped to my leg? People think we’re a lot of thugs because of that business on Clapham Common. Honestly, I wouldn’t beat up anyone and neither would our mates.</p>\n<p class=\"govuk-body\">“None of the lads I knocked about have ever been in any trouble. All I want to do is to be left alone and enjoy ourselves where we like.</p>\n<p class=\"govuk-body\">“We tried to get into a pub this evening, but they turned us away when they saw we were Teddy Boys.”</p>\n<p class=\"govuk-body\">All the Edwardians I spoke to that night were in the building trade and earning good money – about £8 or so a week.</p>\n<p class=\"govuk-body\">Robert Lazer showed me his hands. “Don’t tell us we don’t do any work,” he said. His fingers were covered with blisters. “You don’t get them hanging around about the streets all day,” he said proudly.’</p>\n","id":"2CbXtCXaResJ07uzqFA3UA"},"__N_SSG":true}