{"pageProps":{"title":"The Prefabs","contentRichText":"\n<p class=\"govuk-body\">The first stage of building was the prefabricated houses (prefabs) that were churned out in their thousands as war production was channelled into more social uses. These houses were put together as whole sections, transferred from the factory on the backs of transport lorries, and then bolted together when they reached their destination.</p>\n<p class=\"govuk-body\">Though being universally liked by their new occupants, they were intended only as a stopgap until better housing were to become available in the future. In Harold Hill, they were replaced from the 1960s onwards with more conventional housing on the Briar Road estate. The appealing features of the prefabs were the kitchen area, the bathroom and, most impressively, the refrigerator. And, importantly, they were detached – a characteristic that many came to appreciate only when they moved into the terraced housing that replaced them. Altogether, 605 prefabs were erected.</p>\n<p class=\"govuk-body\">By 1948, the houses themselves – some three-bedroomed and some semi-detached – were being built. The building specifications, such as the floor space and ceiling height, were so generous that they remain unparalleled in the history of social housing in Britain. The newly elected Tory government of 1951 would, under the push for greater quantity, reduce this standard several times during their rule.</p>\n<p class=\"govuk-body\">The first redbrick occupants moved into their new homes at the end of 1948.</p>\n<h2 class=\"govuk-heading-m\">Romford Times, Wednesday, 1 December 1948</h2>\n<article class=\"article\">\n  <p class=\"govuk-body\">For Mr Rutherford, a coach driver based at Brentwood, first of the permanent house tenants at Harold Hill, this change of address will not only mean more living room, but an appreciable easing up in his daily routine. While he has been living at Becontree, Mr. Rutherford has been getting up at 2.30 a.m. each day to be at work by 4.50 a.m. Near his work now, he can rise later. The Rutherfords, with one son and three daughters, will move in on Saturday morning. Two other sons are at present in the Forces, and one daughter is in the Women’s Land Army. Their former home, a five-room cottage, will now be occupied by another family in urgent need of accommodation who wish to live at Becontree.</p>\n  <p class=\"govuk-body\">‘A Lovely Home’</p>\n  <p class=\"govuk-body\">Their house is No. 44 Gooshays, a large tree-lined avenue running north through the estate opposite Gubbins-lane. One of the larger types of house being erected on Harold Hill, it is described by Mrs. Rutherford as ‘a lovely home’; it has a living room, sitting room and three bedrooms, kitchen (115 sq. ft.), and an additional water closet on the ground off the rear entrance lobby. Heating in the living room is by an open fire, fitted with a back boiler to provide hot water supply, and with connector flues to warm a number of other rooms. Other amenities include space for a perambulator and fuel and tool stores.</p>\n</article>\n","id":"4XY94w85SKmnzdZJ31v5yB"},"__N_SSG":true}