{"pageProps":{"title":"The New Despotism Marches On – Romford Times editorial, 15 January 1947 ","contentRichText":"\n<article class=\"article\">\n  <p class=\"govuk-body\">Whatever views may be held as to the desirability, or otherwise, of the mammoth L.C.C. estate near Gallows Corner – and there has been limitless controversy on the question for over a year – one thing is pretty certain; it was a foregone conclusion nearly 18 months ago when, to the consternation of Romford Council and the L.C.C., the Romford Times revealed the project. Indeed, the tremendous fluttering which the disclosure alone caused in the official dovecotes made it very apparent that the scheme was, to all purposes, cut and dried in 1945. Therefore, we do not see how last week’s Ministry of Health inquiry into the ‘proposed’ compulsory purchase of the land involved can be constructed as other than a polite farce, a sop to the public. For, it seems evident that L.C.C. gained the Ministry’s tacit consent to the plan long before the public – and possibly before the local Council – heard even a wisher.</p>\n  <p class=\"govuk-body\">That much seems obvious from facts which emerged at the inquiry. It was declared at one point, for example, with ‘chapter and verse’ quoted, that the matter had been ‘pre-arranged between L.C.C. and the government… beyond any possible doubt of review.’ And in the past year steady planning on the project has forged ahead. It is hardly likely, therefore, that the scheme, having gone so far, would be allowed to stand in the slightest peril of falling down at the last hurdle. In short, it comes to this: the Ministry are virtually a judge and jury trying a case in public which they have already decided in camera. This, of course, is not, unhappily, an isolated case; it is happening wherever satellites of quasi-satellite towns are mooted. The country is now suffering acutely from the ‘new Despotism’ which a former Lord Chief Justice warned over a decade ago was even then gathering strength. Shades of Magna Charta!</p>\n</article>\n","id":"4LaXUV89QCoPejkoWVj0wK"},"__N_SSG":true}