{"pageProps":{"title":"Victorian Philanthropy","contentRichText":"\n<p class=\"govuk-body\">The construction of Harold Hill, part of the post-war New Towns movement, was the high-water mark of municipal and social housing building in Britain. It was an accumulation of nearly 150 years of theory and practice that started when factory owners, having grown rich from the profits accumulated during the Industrial Revolution, began paying attention to the plight of their own workers. Often, this attitude was based upon dissenting Christian ideals held by men such as David Dale but also by political radicals such as Robert Owen.</p>\n<h2 class=\"govuk-heading-m\">David Dale</h2>\n<p class=\"govuk-body\">The first, David Dale, born in 1739, was a successful Scottish cotton factory owner, and in 1784 he opened mills at New Lanark and then established new premises at Blantyre, Sutherland and Oban. He took in pauper children from the workhouses of Glasgow and Edinburgh, as well as refugees from the Highland Clearances. Uniquely for the time, he also provided a basic standard of education and homes for his employees.</p>\n<h3 class=\"govuk-heading-m\">Robert Owen</h3>\n<p class=\"govuk-body\">Marrying into the family in 1799 was Robert Owen. Moving from Manchester, where he had already made a name for himself as a philanthropist, he took charge of New Lanark, and invested more money into the workforce and housing quarters. It is Owen’s association with the model village that is best remembered today.</p>\n<p class=\"govuk-body\">Others later in the 19th century would also engage in striving to find solutions to the dire problems of urban poverty to be found at that time: people such as Colonel Edward Akroyd, who constructed Copley and Akroydon near Halifax; Sir Titus Salt, who created Saltaire near Bradford; William Hesketh Lever, who played a principal role in building Port Sunlight in the Wirral; George Cadbury, who instigated Bournville next to Birmingham; and the Rowntrees, with New Earswick just outside York. The names of these industrialists are still a familiar feature on products found within today’s kitchens and bathrooms.</p>\n<p class=\"govuk-body\">Although not all these new towns survived, the ideals behind them lasted far longer and were part of the infusion that created the new towns and estates after the Second World War.</p>\n<p class=\"govuk-body\">Owen first began to draw attention to his ‘self-supporting home colonies’ in 1817. Here, 1,200 persons would occupy a quantity of land from 1,000 to 1,500 acres, some details of the settlement being:</p>\n<p class=\"govuk-body\">\n  ‘To the right of this building, of which the ground-floor will form the infant school, and the other a lecture-room and a place of worship.\n  The building to the left contains a school for the elder children, and a committee-room on the ground floor; above, a library and a room for adults.\n</p>\n<p class=\"govuk-body\">In the vacant space within the squares, are enclosed grounds for exercise and recreation: these enclosures are supposed to have trees planted in them.<sup><a href=\"#user-content-fn-1\" id=\"user-content-fnref-1\" data-footnote-ref=\"\" aria-describedby=\"footnote-label\" class=\"govuk-link\">1</a></sup></p>\n<p class=\"govuk-body\">In 1841, still banging the home colony drum, he further detailed his ideas, selective paragraphs of which are:</p>\n<p class=\"govuk-body\">\n  ‘At each corner of the square will be a large building, designed for a school or college, – the four constituting an university, for the scientific formation of a superior character – physical, intellectual, moral, and practical – from infancy to maturity.\n  In the centre of each side of the square will be a magnificent building, containing Assembly and Concert Rooms, Libraries and Reading Rooms, Museums, Laboratories, Artists’ Rooms, Lecture Rooms, Committee Rooms, Places of Worship, &#x26;c. &#x26;c.\n</p>\n<p class=\"govuk-body\">1st, a Basement Story, to be used as Store-Rooms, &#x26;c.; as well as for a variety of purposes connected with the apparatus for Warming and Ventilating, and supplying with Hot and Cold Water, and artificial Light, every apartment throughout the whole square.</p>\n<p class=\"govuk-body\">Within the square, also, and conveniently situated with regard to the other buildings, will be Gymnasia, and Baths.</p>\n<p class=\"govuk-body\">The whole of the interior of the square, will be laid out in the most tasteful and scientific manner, as Pleasure Grounds; containing Botanical, Horticultural, and Floricultural Gardens.</p>\n<p class=\"govuk-body\">This, then, is a general description of what may be fairly termed A Magnificent Palace, containing within itself the advantages of A Metropolis, An University, and A Country Residence, without any of their disadvantages, and situated within A Beautiful Park of 2000 or 3000 acres; the whole most scientifically arranged, and placing within the reach of its inhabitants, at a very moderate annual expenditure, arrangements far superior to any known, for the production and distribution of wealth, the formation of character, and the government of the population, with innumerable advantages never yet possessed by the most favoured individuals in any age or country.’<sup><a href=\"#user-content-fn-2\" id=\"user-content-fnref-2\" data-footnote-ref=\"\" aria-describedby=\"footnote-label\" class=\"govuk-link\">2</a></sup></p>\n<p class=\"govuk-body\">Owen’s plans were based on the close proximity of both agricultural land for food, parks for the wellbeing of the workforce and factories for local employment.</p>\n<p class=\"govuk-body\">Today, they translate as a cross between a humane workhouse and the Israeli kibbutzim.</p>\n<p class=\"govuk-body\">Points that draw attention are the central importance of places of learning, churches, entertainment areas, libraries, fitness centres, heated apartments with artificial (gas) lighting and hot and cold running water, as well as gardens and green space that were to be both within and around the residential area.</p>\n<p class=\"govuk-body\">These are essential points, reflecting the radical nature of Owen’s plans, and which, in a more appropriate 20th century form, would come of age in Harold Hill.</p>\n<p class=\"govuk-body\">What once seemed utopian would become a reality.</p>\n<p class=\"govuk-body\">On his deathbed, Robert Owen was asked by a church minister if he regretted wasting his life on fruitless projects. He responded, ‘My life was not useless; I gave important truths to the world, and it was only for want of understanding that they were disregarded. I have been ahead of my time.’</p>\n<p class=\"govuk-body\">Principles of the most progressive planning ideas were being standardised in the 19th century. At the heart was to be a self-reliant community of some thousands; within easy reach would be places of employment, schools, recreation opportunities, all to be entwined with and surrounded by green areas. Most important was the redistribution of population away from the cities.</p>\n<section data-footnotes=\"\" class=\"footnotes\">\n  <h2 class=\"sr-only govuk-heading-m\" id=\"footnote-label\">Footnotes</h2>\n  <ol>\n    <li id=\"user-content-fn-1\">\n      <p class=\"govuk-body\">Report to the Committee of the Association for the Relief of the Manufacturing and Labouring Poor. A Supplementary Appendix to the First Volume of the Life of Robert Owen. London: Effingham Wilson, 1858, Vol. I.A, Appendix No.1, 1817. <a href=\"#user-content-fnref-1\" data-footnote-backref=\"\" class=\"data-footnote-backref govuk-link\" aria-label=\"Back to content\">↩</a></p>\n    </li>\n    <li id=\"user-content-fn-2\">\n      <p class=\"govuk-body\">‘General Arrangements of the Proposed Home Colonies’. In: A Development of the Principles and Plans on which to Establish Self-Supporting Home Colonies. London: Home Colonisation Society, 1841, p.37–40. <a href=\"#user-content-fnref-2\" data-footnote-backref=\"\" class=\"data-footnote-backref govuk-link\" aria-label=\"Back to content\">↩</a></p>\n    </li>\n  </ol>\n</section>\n","id":"5iY9i7n6KvrbqvMQPhKE0t"},"__N_SSG":true}