{"pageProps":{"title":"World War Two: Replanning and Construction","contentRichText":"\n<p class=\"govuk-body\">So, in the Garden City Movement there was a strong theoretical and practical experience that laid down the basis for the future Harold Hill, to be built in the 1940s. But, before the conception of Harold Hill, the Second World War intervened: a catastrophe of such gigantic proportions that, though it did not cause a complete break with economic and social continuity, it certainly heralded a major psychological break.</p>\n<p class=\"govuk-body\">Even to this day, history is often measured in language that uses terms such as ‘after the war’ and ‘since the war’. For many people, one feels, history started in the 1950s, from which came modern civilization.</p>\n<p class=\"govuk-body\">Most notably, though, out of the human cost of war on the home front came the final flattening of the slums that had truly begun in the 1930s.</p>\n<h2 class=\"govuk-heading-m\">The Greater London Plan, 1944</h2>\n<p class=\"govuk-body\">The slum clearance programme had begun in earnest in the 1930s, but it wasn’t until the destruction of World War Two that the opportunity was given for social planners and thinkers to obtain the necessary authority.</p>\n<p class=\"govuk-body\">A prominent individual at the top of this growing mass of reformers was Patrick Abercrombie. Born in 1879, he trained as an architect before becoming the Professor of Civic Design at the Liverpool School of Architecture (established by Lever) in 1915. Afterwards, he made award-winning designs for Dublin city centre and gradually asserted his dominance as an architect of international renown.</p>\n<p class=\"govuk-body\">In 1942, he produced the County of London Plan for the London County Council (LCC), and in 1944 he wrote the Greater London Plan for the Ministry of Works and Buildings. The later document was an extended and more thorough product than the 1942 publication, and for Abercrombie it was an accumulation of nearly 50 years of experience and knowledge in the field of planning and architecture.</p>\n<p class=\"govuk-body\">It was the most ambitious scheme that London had ever seen.</p>\n<h3 class=\"govuk-heading-m\">New thinking for New Town planning</h3>\n<p class=\"govuk-body\">The new neighbourhoods were the subject of careful detail. Taking 10,000 people as the optimum number (Harold Hill was to become 30,000 strong, made up of three neighbourhoods), there were to be provided ‘social, educational, administrative and other public buildings; hospitals and clinics; facilities for leisure and recreation (indoor and out); provision for shopping and marketing, warehousing and storage; and special equipment concerned with transport, services, and other utilities’.</p>\n<p class=\"govuk-body\">For every neighbourhood of 10,000 people there were to be 100 acres of open space, which would include 20 football pitches of various sizes, 10 acres of cricket, athletics and lawn tennis courts, half an acre for a bowling green, 18 hard tennis courts, and 12 hard netball courts.</p>\n<p class=\"govuk-body\">Space was key to the design. While the Inner ring of old had up to 200 persons per acre, the Green Belt areas would have a proposed 28 persons per acre. So, for every 50 acres of housing, there would be a corresponding 7 acres for primary school buildings, 7 acres for shops, 5 acres for community buildings, 3 acres for public buildings, 5 acres for industry, and 23 acres for main roads and parking.</p>\n<p class=\"govuk-body\">There would be one shop for every 75 persons, or 200 shops per neighbourhood; churches would be provided for 10 per cent of the population, or there would be two per neighbourhood; there would be four nursery schools, two infant schools and two junior schools; for two 10,000-strong neighbourhood units, there would be respective boys’ and girls’ secondary modern schools. For the layout, utmost attention was given to green space that would network the new residential areas ‘into a continuous system by footpaths, park strips, riverside walks, bridle-walks and green lanes’.1 Building within the boundaries of the natural environment was heavily emphasised, so existing features such as ponds and parks should be built around rather than bulldozed over, making the layout complement rather than overshadow nature.</p>\n<p class=\"govuk-body\">Lewis Mumford and Frederic J. Osborn comment on the Greater London Plan</p>\n<p class=\"govuk-body\">As Lewis Mumford, the highly regarded author of The Culture of Cities, later wrote: ‘I don’t know which to admire more about Abercrombie’s work: its intellectual penetration, its political skill, its beauty of presentation, or its all-round comprehension of the planners and the citizen’s job.’2</p>\n<p class=\"govuk-body\">It sparked a wider debate, of which Frederic J. Osborn noted: ‘The broad principle of the Plan is what we have been fighting for all these years… “Everybody” is talking about Dispersal, Satellite Towns, Green Belts, Location of Industry, etc.’3</p>\n<p class=\"govuk-body\">Patrick Abercrombie, knighted in 1945, passed away in 1957, but not before (at the invitation of the British Government) redesigning Hong Kong; in 1956, at the invitation of Emperor Haile Selassie, he drew up plans for the capital of Ethiopia, Addis Ababa.</p>\n","id":"5zNSSLPhe4JwloSBHTQri1"},"__N_SSG":true}