{"pageProps":{"title":"The 1960s Albemarle Report Leads to the First Youth Club","contentRichText":"\n<p class=\"govuk-body\">In 1963, Harold Hill youth were finding out about the new meeting place – the Albemarle Youth House on Gooshays Drive. The first purpose-built youth club in Harold Hill, it came from a turn-of-the-decade government report that recommended the expansion of Britain’s youth service. Partly based upon concern, as always, over rising crime among adolescents, it also came from a genuine concern that the youth – all the youth, delinquents or not – were not properly catered for.</p>\n<p class=\"govuk-body\">Previous provision in the 1950s was sport-based, which was a direct continuation of 1930s policy. Then, the government – panicked by romantic images of healthy German Nazi adolescents in the gymnasium and on the playing field – invested to improve the health and stamina of Britain’s children. The clubs would often find themselves under the direction of a retired commissioned officer who, presumably, was regarded as being able to instal the necessary discipline. Activities for girls were often non-existent.</p>\n<p class=\"govuk-body\">Harold Hill’s first youth club, the Apollo, opened in the summer of 1949. Thursdays were ‘boxing nights’, and boxing was practised in a ring rigged up in a field near Gooshays Farm. The club also had cycling, football and cricket sections, with the cricket section operating under the tuition of an Essex professional living on the estate.</p>\n<p class=\"govuk-body\">Throughout the 1950s, Harold Hill teenagers had little to do apart from attend church-based youth clubs, which were not always popular – as these testimonies from 1959 confirm:</p>\n<blockquote>\n  <p class=\"govuk-body\">\n    ‘On Harold Hill in my view there is not enough for teenagers to do. More youth clubs are maybe the answer. I am a member of a Church youth club which to me is badly situated at Noak Hill. At the club there are not enough members, or any variety like different groups could be formed, but we have not enough members. The reason is because the hall is way out in the country and that it is a Church youth club... not many teenagers are willing to go.’\n    – Christine Ruff\n  </p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">\n    ‘There are a few clubs but they are attached to the churches and many of the teenagers will not go near them.’\n    – Rosemary Marshall\n  </p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">\n    ‘There is nothing to do at night. I used to go to a club with a group of other boys and girls but they would not allow us to have jiving or dancing of any kind so we would just sit all evening if we did not want to play billiards, table tennis, darts etc. So we left. I also used to go to a church club where they had jiving but my mother and father stopped me going.’\n    – Christine Casey\n  </p>\n</blockquote>\n<p class=\"govuk-body\">In the same year there were still calls for better youth provision. Mr A. Martin of the Association Society of Woodwork Machinists, speaking at the Romford and Hornchurch Trades Council, called for more facilities, citing: ‘They have nothing to do but make a nuisance of themselves.’</p>\n<p class=\"govuk-body\">The situation in Harold Hill was repeated in many other places, which led to action from the authorities.</p>\n<p class=\"govuk-body\">The Albemarle Report, named after the chair, Lady Diana Albemarle, was the government’s first serious post-war attempt at both summarising the condition of the national youth service and producing a plan assessing the contribution that the Youth Service of England and Wales could make in assisting young people with playing their part in the life of the community, in light of changing social and industrial conditions.</p>\n<p class=\"govuk-body\">The report’s tone was critical of the past emphasis on values that by the 1960s were looking increasingly anachronistic, even to these establishment figures. ‘Service’, ‘dedication’, ‘leadership’ and ‘character building’ were deemed to be terms that would find little response among contemporary youth, with these particular words not connecting with the realities of life as most young people saw them – they did not seem to ‘speak to their condition’. It was a fundamental shift away from previous doctrinaire forms of youth work and away from all references to ‘Christian values’ that had been such a feature of voluntary and paid youth work before. Key to the proposals of the committee was a noticeable expansion of funding that would alleviate the financial shortfalls experienced by associations in the country:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘Lack of finance is at the root of several shortcomings we have noted: clubs that frequently have to function in dingy drab premises; lack of equipment for the job; insufficient provision for outdoor recreation; and failure to measure up to the needs of new towns and housing estates, summed up in the remark of the boy who described one of these estates as “a graveyard with lights”.’</p>\n</blockquote>\n<p class=\"govuk-body\">Also, for the first time, youth workers would be expected to undertake planned education courses that not only gave them the necessary grounding before their employment commenced, but also gave their status more professionalism:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘To sum up: the question now should not be, ought there to be a Youth Service, but can this country any longer make do with one so plainly ill-equipped to meet the needs of the day. In this time of unprecedented plenty, the lives of many young people are likely to be poorer at 20 than one might have guessed on seeing them eagerly leave school at 15. Young people have never been more in a crowd – and never more alone; without a Youth Service many of them would not be more free but less free. A properly supported Youth Service can help many more individuals to find their own way better, personally and socially. This country must choose to have a Youth Service adequately provided for these most important purposes.’</p>\n</blockquote>\n<p class=\"govuk-body\">The first generation of trained and qualified youth workers found themselves beginning their careers in the mid-to-late 1960s, which was a remarkable time for young people. A change was underway in which the post-war lull of national and international calm was breaking.</p>\n<p class=\"govuk-body\">The decade started slowly, but reached its crescendo in 1967 and 1968 as a whole series of violent episodes rocked the world – not least the realisation that America was losing the Vietnam War and doing so with horrendous casualties.</p>\n<p class=\"govuk-body\">On the home front, the Labour government had liberalised much law, including legalising abortion and allowing the women’s contraceptive pill to be made available via prescription.</p>\n<p class=\"govuk-body\">Notable too was the vibrant music scene, led by The Beatles, which for the first time mixed social issues with technology and reached a mass audience.</p>\n<p class=\"govuk-body\">It was inevitable that all these events would influence Harold Hill youth.</p>\n","id":"6g2RT84Nsgt2BQ5a0K48Kb"},"__N_SSG":true}