{"pageProps":{"title":"‘I’ve Been Trying to Get Away from Here Ever Since I Came’?","contentRichText":"\n<p class=\"govuk-body\">Nevertheless, despite a number of leisure and hobby clubs, boredom was a persistent complaint from when the first residents moved into the first prefabs in 1940s and throughout the 1950s. It was certainly something the local press picked up on, either sympathetically or disparagingly, for years.</p>\n<p class=\"govuk-body\">Under the title of ‘Hundreds Try To Quit Harold Hill’, the Romford Times recorded the following opinions in March 1953:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘I’ve only been here six months and I am sick to death of Harold Hill. I’ve been trying to get away from here ever since I came.</p>\n  <p class=\"govuk-body\">Nine out of ten people will tell you the same as I will. There is just nothing to do here. There are no cinemas, dance halls or pubs. That’s what I miss.</p>\n  <p class=\"govuk-body\">\n    It’s not too bad for those with their own transport, but when you realise that it costs 10d. to go to Romford and back it’s a different story altogether.’\n    – Constance Snell\n  </p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">\n    ‘You think of it – 10s. extra rent a week than they used to pay previously, and on top of that fares to London each week. That makes quite a hole in the working man’s pocket.’\n    – Cyril Lancaster\n  </p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘Believe me, that advertisement is just one of dozens that I have displayed in an effort to get away from this place. I have been trying to leave ever since I came here 18 months ago. My husband wants to go back to London, too.</p>\n  <p class=\"govuk-body\">We are so lonely here. You must have fun while you are young, mustn’t you? I want to see life again. I would far rather live in a flat in London than in a house in Harold Hill.</p>\n  <p class=\"govuk-body\">\n    If I want to have a day out in town it costs me a small fortune because I cannot leave the children at home. The cost of fares is a terrible burden on us.’\n    – Stella Rose\n  </p>\n</blockquote>\n<p class=\"govuk-body\">Reflecting decades later, residents commented upon the unrest that many felt in the early years:</p>\n<blockquote>\n  <p class=\"govuk-body\">\n    ‘What happened was that when I visited the house, the lady next door, Mrs Hastings, said, “Anybody who doesn’t take these places doesn’t really need a place.” I thought I better take it because it was my third opportunity. There was a lady next door called Mrs Ricks, and she went within six months, while Mrs Hastings left after four years. In fact, she stayed the longest, but the rest of them were here today, gone tomorrow.’\n    – Mrs Munday\n  </p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘When they opened these estates like Harold Hill, East London people couldn’t stomach it because it was so quiet and they came back. And Harold Hill was the same, it was like a graveyard.</p>\n  <p class=\"govuk-body\">\n    The main attraction though was Fords. They used to work shift work, two weeks on and two weeks off. All the men went to work and all the women stayed at home and locked their doors because there was nothing to do.’\n    – Danny Silver\n  </p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">\n    ‘I remember getting off the removal van, such as it was, because we never had any furniture, and for years and years I cried because I wanted to go home, and when I got married I went back to Tottenham and within five months I was back here because I hated it in London.’\n    – Brenda Dryer\n  </p>\n</blockquote>\n<p class=\"govuk-body\">For some time, the local shops were full of cards from hopeful tenants seeking a swap with London tenants – and certainly there were many, as an LCC spokesman admitted in 1953:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘It’s true that people are trying to leave Harold Hill. For instance, five families left in one week alone last month.</p>\n  <p class=\"govuk-body\">During the past three months nearly 40 families have packed up and returned to London and the Home Counties. A slow outflow is being maintained throughout the year.’</p>\n</blockquote>\n<p class=\"govuk-body\">Those leaving through official channels would have been the tip of a much larger iceberg, with most returnees seeking to do so with informal swaps.</p>\n<h2 class=\"govuk-heading-m\">Happiness Found in the Post-War Reconstruction</h2>\n<p class=\"govuk-body\">It was for many, though, the new start that they had long sought.</p>\n<p class=\"govuk-body\">An interesting series of feature articles was run in the Romford Recorder during 1956 and 1957. Called ‘Down Your Street’, two journalists picked a road in either Romford or Hornchurch and interviewed the residents to give a flavour of its inhabitants. The three streets picked in Harold Hill were Chippenham Road, Petersfield Avenue and Gooshays Drive. They provide some interesting insights into the backgrounds of residents before they moved to the estate.</p>\n","id":"3Sr88UzGjRh7biYQ0q8hxF"},"__N_SSG":true}