{"pageProps":{"title":"Community Activists in Harold Hill","contentRichText":"\n<p class=\"govuk-body\">Right from the beginning, local community activism on the Hill has been carried out by small, determined groups and individuals, much of the time despite the indifference and apathy of the majority. This, in the face of such hurdles, makes their contribution to local society even more impressive: there are some individuals who have spent their lives on the wellbeing of the local estate.</p>\n<h2 class=\"govuk-heading-m\">Winifred Jay – Labour Party</h2>\n<p class=\"govuk-body\">The first activist of note was Winifred Jay (1900–54), who was one of the first tenants to move to Harold Hill. Despite having her own family she took on a leadership role, and her personal efforts saw better street lighting and an improved bus service. She was also one of the principal sponsors of the RSPCA clinic, and she and her husband took on the positions of secretary and assistant secretary of the Community Association when interest flagged.</p>\n<p class=\"govuk-body\">Councillor Olive Roberts said in her memory:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘I worked with Mrs Jay when the Tenants’ Association was first formed. She was a great woman and took an interest in everybody. She would help in any socials and dances that were being organised and even when she was ill helped the first drama group formed on the estate.’</p>\n</blockquote>\n<h3 class=\"govuk-heading-m\">Ben Cohen – Communist Party</h3>\n<p class=\"govuk-body\">The second activist of note was Ben Cohen (1910–77), the long-term branch secretary of the local Communist Party and a stalwart of local politics for nearly three decades (until his untimely death in a plane crash in Havana, Cuba, in 1977). Ben may have played a greater role in local campaigns than any other individual. A constant presence for decades, he both instigated and supported various incarnations of the Tenants’ Association. Although a school headmaster by profession, he never belittled or patronised those he worked with, which gave him a loyal and respectful following among tenants and Labour Party activists.</p>\n<p class=\"govuk-body\">Decades later, some of the opinions of him included:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘That man never had a selfish thought in his life.’</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘He was the only man I ever met who thought the invasion of Hungary in ’56 was a good thing.’</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘Ben Cohen was a very clever man. It was sad because a lot of his views were only for the good of the people: everybody should have equal opportunity. But people were scared of communism, but he was a very intelligent man and I had a lot of intelligent conversations with him.’</p>\n</blockquote>\n<p class=\"govuk-body\">After Ben’s untimely death, the following eulogy was produced (complete with grammar and spelling mistakes) by the local Tenants’ Association:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘In Memory of a Comrad</p>\n  <p class=\"govuk-body\">How can one sit, and put pen to paper.</p>\n  <p class=\"govuk-body\">To try to explain One mans lifetime,</p>\n  <p class=\"govuk-body\">Had this man written, his life story, it would go from school children, for which he was an Head Master for many years, and well respected.</p>\n  <p class=\"govuk-body\">To many familys on Harold Hill. He spent most years of his life with his Dear Wife, who he lost, just a few years ago. Working for his public representing them on many various committees.</p>\n  <p class=\"govuk-body\">His time and Patience were often Rewarded by the many letters he Received from his Public Thanking him.</p>\n  <p class=\"govuk-body\">His Chairman of the Harold Hill Tenants Association.</p>\n  <p class=\"govuk-body\">We the Committee, Have Lost a very learned Gentleman for the working class people of Harold Hill and Surrounding Districts.</p>\n  <p class=\"govuk-body\">This Man This Ben Cohen. Gave untold Time, to help his Public, that were in Some Distress.</p>\n  <p class=\"govuk-body\">To His Memory The Harold Hill Tenants Committee will pledge its self to Carry on his Good Work. For we know That this would have been his Last Wish. To his Sons Simon and Michel you both had a father to be Proud of.</p>\n  <p class=\"govuk-body\">There are Very few people on the Harold Hill Estate who can claim the Respect and admiration of Ben Cohen.</p>\n  <p class=\"govuk-body\">He will be missed.</p>\n  <p class=\"govuk-body\">But his memory will live on.’</p>\n</blockquote>\n<h4 class=\"govuk-heading-m\">Amy Crockford – Labour Party</h4>\n<p class=\"govuk-body\">Although Amy Crockford (1909–85) was a long-term member of the Labour Party and Gooshays ward secretary for some years, her impact on Harold Hill is best remembered through her work on the St Neots playground. A powerful character, she was, as one contemporary remembered, ‘a bundle of dynamite, very forceful; you didn’t mess with Amy. She knew her views were always right’.</p>\n<p class=\"govuk-body\">Amy ran this pioneering children’s play area from 1957 until 1975, until forced to retire at the age of 66.</p>\n<p class=\"govuk-body\">Her first attempt at the scheme was in 1955, when she persuaded Bermondsey council to open an adventure playground. Amy then started another one in Harold Hill after moving to the estate a couple of years later. It was to be the first in the country, as she later explained:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘I always loved kids. I was brought up in Hoxton, one the slum areas of East London, so I understand the problems children face from that particular background experience.</p>\n  <p class=\"govuk-body\">Twenty years ago (1955) my husband walked out and left me with my three children. I was shattered. A friend of mine came back from America shortly afterwards with lots of go ahead ideas.</p>\n  <p class=\"govuk-body\">One of these was “junk playgrounds” where children could do virtually anything they liked under supervision.</p>\n  <p class=\"govuk-body\">I thought it was a great idea. It was a battle to convince people that it would work, but we managed.’</p>\n  <p class=\"govuk-body\">Despite staging a campaign to force the council to employ her beyond retirement age, in 1975 she left the job that, over the years, had won her the admiration of legions of adoring kids.</p>\n  <p class=\"govuk-body\">Awarded an MBE in 1977 for her work for young people and welfare groups in the local area, she said:</p>\n  <p class=\"govuk-body\">‘Never in my wildest dreams did I think I would ever be called to Buckingham Palace to receive an MBE.</p>\n  <p class=\"govuk-body\">I miss that playground every day and I still believe I should have not been pensioned off.</p>\n  <p class=\"govuk-body\">Since leaving I have battled for many years – for tenants on the estate, for the poor, for the old, for the deprived.</p>\n  <p class=\"govuk-body\">I would gladly trade in my MBE – glad of it though I am – to take up my post at St Neots again.’</p>\n</blockquote>\n<h5 class=\"govuk-heading-m\">Frank and Reta Coffin – Quakers</h5>\n<p class=\"govuk-body\">Frank (1909–99) and Reta Coffin (1909–2001) were consistent in their dedication to Harold Hill from when they first moved to the estate in the early 1950s to when they passed away almost 50 years later. Both were religious Quakers, vegetarians and pacifists, and they served as Labour councillors for Harold Hill over a number of decades, including time as mayor and mayoress in the 1970s.</p>\n<p class=\"govuk-body\">Frank grew up in South London and Brighton, one of five children. He made a decision at the age of 10 to become a vegetarian – a decision he stuck with for the rest of his life. Active in the temperance – that is, anti-alcohol – movement, he met Reta at a meeting of the International Order of Good Templars.</p>\n<p class=\"govuk-body\">Reta Schwindt had grown up with hardship. Having lost her father to alcoholism, she was forced to leave school and become a wage-earner at a young age. Her experiences of her father’s problem led to her signing the temperance pledge, as a result of which she met Frank, and they married in 1931.</p>\n<p class=\"govuk-body\">The following 10 years were ones of much change for the Coffins as they lived in a variety of places – including Welwyn Garden City, where they first became politically active and joined the Labour Party and the Peace Pledge Union. They also joined the Christian Society of Friends (Quakers), the beliefs of which required them to observe absolute pacifism.</p>\n<p class=\"govuk-body\">Come the Second World War, their religious philosophy meant spending the years working on the land in Tolleshunt Knights in Essex. These were particularly hard years for these two conscientious objectors, but out of this came Frank Coffin’s involvement with the National Union of Agricultural Workers and his appointment to the role of National Organiser in 1952.</p>\n<p class=\"govuk-body\">After moving to Harold Hill, Frank was first elected to Romford County Council in 1953, with Reta becoming a councillor and joining her husband in the town hall not long after.</p>\n<p class=\"govuk-body\">He carried on sitting on the bench in Romford, first becoming a local magistrate in Colchester. After being awarded an MBE in the 1972 New Year’s Honours List, he retired from the local judiciary in 1979 at the grand age of 70.</p>\n<p class=\"govuk-body\">Reta was elected mayor in 1971 and again a few years later. Not being a political animal, she was less interested in the town hall and more enthusiastic about the public engagements that such a position involved.</p>\n<p class=\"govuk-body\">Whether as Christians or Socialists, both Frank and Reta were dedicated to religious and political ideals that were firmly rooted in a love of the people and, for the Coffins in particular, a love of the people of Harold Hill.</p>\n","id":"RZ1FwxnGk4LgOzDRQzsGX"},"__N_SSG":true}