{"pageProps":{"title":"The Community Association","contentRichText":"\n<p class=\"govuk-body\">Two organisations, the Tenants’ Association and the Community Association, have played prominent roles in Harold Hill over the decades.</p>\n<h2 class=\"govuk-heading-m\">The Harold Hill Community Association</h2>\n<p class=\"govuk-body\">The Harold Hill Community Association began at a meeting sponsored by the London Council of Social Service in February 1953 when 150 tenants gathered to discuss the possibility of opening a community centre. Gooshays Farm House was put forward as one prospect. In May, the same number of residents turned out again to see the adoption of a constitution for the Community Association, the objectives being: to promote the wellbeing of the community by a common effort to further health, advance education and stimulate physical, intellectual and moral development; to foster a community spirit; to assist in the maintenance and the management of a community centre; to operate in a non-political and non-sectarian way.</p>\n<p class=\"govuk-body\">There was a battle between the Working Men’s Club and the Community Association over the use of Gooshays Farm, which also included a straw-roofed 18th century barn, the biggest in Essex. The Community Association won, with the opposing group moving into the Red House (which continued as a Working Men’s Club until the 1990s).</p>\n<p class=\"govuk-body\">Mr R.J. Frost, part-time warden and Broadford school teacher, announced: ‘It will take a long time to get the Association running smoothly, but when we do, it will be of great benefit to the residents of the estate.’</p>\n<p class=\"govuk-body\">Familiarly, the following week’s Romford Times reported that the building had been vandalised, this time by Teddy boys.</p>\n<p class=\"govuk-body\">By the summer of 1956 the Community Association had a total of 218 individual members, with 15 affiliated organisations. Their magazine, Farm House News, had a circulation of 1,000, while every room in the Gooshays Farm House was fully booked daily during the week with classes such as needlework and motorcycle maintenance.</p>\n<p class=\"govuk-body\">By 1957, however, the membership had dropped to 130, with a corresponding decline in enthusiasm; five years after starting, it looked in terminal decline.</p>\n<p class=\"govuk-body\">Typical of the dedication of the small minority of activists, 22 people went out to knock on doors and recruited 256 new members. The chairman of the Community Association said: ‘We visited 777 houses in selected areas. On average, each canvasser has spent 40 evenings or Sundays going from door to door explaining our aims. They have done a wonderful job.’</p>\n<p class=\"govuk-body\">By 1959 that had risen to 500 members, and from there continued years of pressurising the authorities to build the community centre, which was finally built in the mid-1960s.</p>\n<p class=\"govuk-body\">Hundreds of estates and towns had their own Community Association.</p>\n","id":"6u77BtXBD6jkDSMhmlpM3x"},"__N_SSG":true}