{"pageProps":{"title":"Forging the New Jerusalem: Reflections of a New Town Planner","contentRichText":"\n<p class=\"govuk-body\"><strong>What was your role in the New Towns movement and where did you work?</strong></p>\n<p class=\"govuk-body\">I was trained as an economist and I wanted to use my economic capability in planning in some way or other; this was immediately after the war. The New Towns were then the big thing; the New Towns Act had been passed in 1946.</p>\n<p class=\"govuk-body\">I worked in Peterlee, County Durham, which was a New Town in a mining area. I was only there for a year, from 1949 to 1950.</p>\n<p class=\"govuk-body\">In 1951 I went to Crawley in Sussex, one of the London ring New Towns, and I worked in Crawley for five years and I lived there for ten years.</p>\n<p class=\"govuk-body\">My role was mainly carrying out social and economic research as a basis for planning. So, in Peterlee I worked on an analysis of the existing population and tried to work out their needs because it was a large mining district. The idea was to put a New Town in the middle of all the mining villages, so we had to forecast what sort of people would come to live there, their age distribution, their occupation, that sort of thing. I also worked on possible industries for the New Town.</p>\n<p class=\"govuk-body\">In Crawley I was called a research officer. I was directly responsible to the Chief Executive, and I had a small unit of my own. We did a variety of things, the most important being keeping a check of all the new people who moved in to provide statistical information. In those days it was fairly easy to do this because rents were all collected on the doorstep in Crawley and I think it was probably the same in the other New Towns at that early stage, although this changed very much later.</p>\n<p class=\"govuk-body\">They had trained housing managers who went around collecting the rents, getting to know the tenants and helping with their problems. And another thing was that they collected information for us. Everybody who came to the New Town had to fill in a form stating their age, the ages of their children, where they were coming from and so on. Because of this system of collecting rents from the doorstep, we were able to keep our information up to date.</p>\n<p class=\"govuk-body\">So we knew when people had babies, we knew when people had lodgers, we knew when people left. We kept a check on the population and this was a basis for forecasting what the population would be in the future. For instance, how many schoolchildren there would be. This was fed to West Sussex County Council, which was providing schools in the New Towns.</p>\n<p class=\"govuk-body\">We gave them fairly accurate predictions on how many age groups and how many kids there would be, but that doesn’t mean that they necessarily provided the school because they were strapped for cash. That was a battle which the New Town tenants took part in.</p>\n<p class=\"govuk-body\">Harold Hill was what was called an ‘out-county estate’ and it was built by the LCC. The difference between the New Towns and the out-county estates was that people could commute back into London to work. That saved the authorities the difficulty of providing employment.</p>\n<p class=\"govuk-body\">New Towns were different in that they were intended to be self-contained in that everybody who lived there had a job there. And in the early days that was how it was, because the only way you could get a house in Crawley was if you had a job there. Although that changed as time went on.</p>\n<p class=\"govuk-body\"><strong>One of the problems in the early days of Harold Hill was the lack of local employment and amenities. Why did they build housing first and amenities later? Why not together?</strong></p>\n<p class=\"govuk-body\">The answer is one word: money. It was a big political issue in the early days. The plans were great, they showed all the amenities – the parks, the schools, the hospital – on the model plans but that didn’t mean they could build them. There were two problems, the first being that although the Development Corporation was responsible for creating the New Towns, it only built houses and factories, and it left everything else to different authorities, such as the local county council. They were responsible for building local playing fields, swimming pools and schools, that sort of thing. But the authorities didn’t get extra money so it was a genuine difficulty for them. They had to find additional funding with no extra help from the government or the Development Corporation. Under the New Towns Act 1946, the Development Corporations did have the power to do anything in the New Towns so legally they could have provided the swimming pool, hospitals, everything. But in practice the government exercised very tight financial controls over them. The main problem was that money was not available.</p>\n<p class=\"govuk-body\"><strong>What about other problems that they faced, such as a shortage of building materials and labour?</strong></p>\n<p class=\"govuk-body\">They were relatively minor problems. There was no real shortage of labour. Building workers came from all over to work in the New Towns because it offered steady employment, big contracts. They were mostly well organised in the building trade unions so they got reasonable rates of pay. There was no real difficulty with that. As for building materials, well there were occasional shortages but it was never a major factor.</p>\n<p class=\"govuk-body\">Once they got into their stride, the New Towns were able to build new houses very rapidly indeed. In Crawley and certainly at Harlow they got up to 2,000 houses a year, which is quite a lot. The problem with the housing was that the rents were high.</p>\n<p class=\"govuk-body\">I don’t know whether that applied to Harold Hill, but in the New Towns, although they had a subsidy from the government, the rents were still high compared to the corresponding rents in London. Comparing the rents in Crawley with those in Hammersmith or Battersea, which was where the people were coming from, it was probably between about 25 per cent and 50 per cent more. The reasons for this were that the London councils could spread their costs over the whole housing stock, which included lots of older houses, and they could cross-subsidise. The New Towns couldn’t do that because all the housing was freshly built and it really needed an additional subsidy to allow for this, and this is one of the things that we campaigned for. No, the rents were high and it was a major problem for the tenants.</p>\n<p class=\"govuk-body\">One of the ideas for the New Towns was the idea of mixed income groups. I don’t know to what extent that was the thinking in Crawley, but it was certainly a big factor in Harold Hill.</p>\n<p class=\"govuk-body\"><strong>When Bevan came to visit he made a speech highlighting the benefits of such a policy. Do you think that this worked?</strong></p>\n<p class=\"govuk-body\">This is a very interesting issue. Planners and sociologists always say that we must have mixed communities, different classes must live together, learn from each other. I don’t think that in practice that has ever worked. What happened in Crawley was that in the early days only the Development Corporation built houses, so all houses were built for rent and they were all more or less of the same standard and everybody moving in was offered one of these houses.</p>\n<p class=\"govuk-body\">In the early days a number of managerial and professional people did go and live in ordinary houses. You would find a factory manager living in the same street as a lot of his workers. But this didn’t last all that long. After a time, about five years, the Development Corporation started selling sites to private builders so the private developers moved in and built houses for sale, and these houses were of a slightly higher standard but they were also segregated. The tendency was for professional people to buy these houses.</p>\n<p class=\"govuk-body\">The other thing that happened was that a lot of better paid people bought houses outside the New Towns in surrounding villages and in nearby towns like Horsham. So there was segregation and there wasn’t anything anybody could do about it.</p>\n<p class=\"govuk-body\"><strong>Another idea behind the post-war building was the integration of the old and the young. Do you think that this succeeded?</strong></p>\n<p class=\"govuk-body\">It was a crucial issue in the New Towns and I suppose certainly in the ‘out-town’ estates such as at Harold Hill. The majority of the people moving in during the early days were youngish couples with young children and those who were about to start their families. They were the people who mostly needed houses and hadn’t had the chance to get them in London. The industries that moved to the New Towns were those that were expanding and wanted to get out of London, and expanding industries tended to employ young people.</p>\n<p class=\"govuk-body\">So that was a factor that was concentrating the age groups in their 20s to 30s and the under 10s.</p>\n<p class=\"govuk-body\">If you have a neighbourhood of 5,000 or 10,000 people then it starts off with a lot of kids and you need a tremendous number of school places, but later as they grow up the numbers drop. In the long-term it sorts itself out, but in the early days it was a problem. Initially, they couldn’t do anything about it because they needed all the houses for the workers moving in, but later, certainly in Crawley and I think in other New Towns, they actually made a point of offering houses to the elderly relatives of those already living there. They built a number of small houses or flats suitable for a single person and a lot of grandads and grandmas came in, which was very good. It was good for them and it was good for the town. But you were never going to get a totally balanced age structure in the new communities.</p>\n<p class=\"govuk-body\"><strong>One of the features of Harold Hill at the beginning was the sheer size of the families. How many children do you think that the average family had in Crawley?</strong></p>\n<p class=\"govuk-body\">I can’t remember a particular figure, but it was probably two-and-a-half to three. Actually, we found that married couples of the same age group in Crawley had fewer children than the national average, which was interesting and we wondered why this was. We speculated that this was because the people who moved to New Towns married later; this was figured because people who married early were higher on the housing list. We hoped to get some confirmation of this but the Development Corporation refused to allow us to ask people how long they had been married. So we never got confirmation, but I’m pretty sure this is what happened. So I think that families in Crawley would have been smaller than those in Harold Hill.</p>\n<p class=\"govuk-body\"><strong>Was there much done to encourage new industries to the new residential areas?</strong></p>\n<p class=\"govuk-body\">Oh yes, in the early days this was very successful. In the 1950s there were a lot of industries in London who for one reason or other wanted to get out. They wanted to expand. There were often a lot of planning restrictions and by-laws in London. Crawley certainly, and I think Harlow and Hemel Hempstead, attracted all the industry they wanted in those early days. In fact, the industry did very well out of it because workers were decently housed and a five-minute cycle ride from the premises. Productivity increased.</p>\n<p class=\"govuk-body\"><strong>Were they given any form of tax breaks and incentives to move to the New Towns?</strong></p>\n<p class=\"govuk-body\">No. There were no financial incentives. Some of the other towns, such as up in County Durham, had a lot more difficulty in attracting industry because of their location.</p>\n<p class=\"govuk-body\"><strong>Did you find in the early days that many families moved in and then moved back to London quite quickly?</strong></p>\n<p class=\"govuk-body\">No. This is something we did monitor. Very few moved back. But how could they move back? Despite higher rents in Crawley, they wouldn’t have been able to get anything in London. They would have gone to the bottom of the waiting list. Private renting was expensive and most of the places were not very healthy. It would have been very hard for people to move back. To be fair, my impression was that very few people wanted to move back in spite of the local difficulties – local rates were higher, rent was higher, goods in the shops were more expensive.</p>\n<p class=\"govuk-body\"><strong>Were they the principal complaints of the new residents?</strong></p>\n<p class=\"govuk-body\">Rents were the principal complaint but the other one was the lack of amenities. There were lots of campaigns run to get schools, hospitals and meeting places, and they were successful. It was a result of the pressure from below that made the authorities get moving.</p>\n<p class=\"govuk-body\"><strong>How did the Tory governments of the early 1960s affect the building of the New Towns?</strong></p>\n<p class=\"govuk-body\">The Tories certainly wanted the New Towns to go ahead. One of the things that got [Harold] Macmillan in power was his boast to build houses faster. So they wanted the New Towns to be built. They didn’t hold them back. But they put up the rate of interest on the rate of borrowing for New Towns so that affected rents.</p>\n<p class=\"govuk-body\"><strong>I understand that they changed the specifications for the building of new houses in order to increase the quantity?</strong></p>\n<p class=\"govuk-body\">That was very noticeable. I could take you to Crawley and to two different neighbourhoods built at the beginning and end of the building programme and you would immediately see the difference in the size of the houses. Some of the early New Town housing was some of the best that has ever been built. It was cut several times by the Tory government.</p>\n<p class=\"govuk-body\"><strong>Do you think that the increasing use of cars in the 1950s and 1960s made the New Towns redundant in many ways? There was the idea of planning neighbourhoods of a fixed size and being self-contained. Did cars have a detrimental effect on this idea?</strong></p>\n<p class=\"govuk-body\">This is a very contentious issue among planners. The idea of planning neighbourhoods was a good one, and it worked. The idea was that each of the neighbourhoods would be centred around the schools, maybe a church, a pub, a meeting place. I think that socially, this works – just one small example being that if mothers pick up their kids from the primary schools then they can go to the shops at the same time, and this is very convenient.</p>\n<p class=\"govuk-body\">Of course, things have changed in a number of ways. The types of shop have changed: there are no greengrocers and everybody is going to the supermarket, which is outside the neighbourhood. The shopping parades now tend to be different.</p>\n<p class=\"govuk-body\">The neighbourhoods were not designed for the current level of car ownership and use that we now experience. Parking is very difficult, with residential streets congested so they are not as safe as they used to be. If the rise of car ownership had been foreseen then the streets would have been planned a different way. It ought to have been foreseen. I can remember a friend saying in the ’50s: ‘Look at the number of cars that the car manufacturers are geared up for turning out. Where are they going? If they are going to make cars then somebody is going to use them.’ It should have been foreseen, but precisely what you do about that is a problem.</p>\n<p class=\"govuk-body\">You have a place like Milton Keynes, which is a third generation of New Towns – it was designed deliberately for car use, so apart from a central area, things were spread around. So you have a community centre in one part, a pub in another part and you spread the traffic and you don’t get congestion. Well, this is perfectly true and this works, but the other side of the coin is that public transport doesn’t work. It is very difficult to live in Milton Keynes and not own a car. In a place like Crawley, even now you can live without a car because the town centre is still within walking distance for a lot of people. We have to find a form suitable for public transport as well as the car, and we still haven’t found that ideal balance yet.</p>\n<p class=\"govuk-body\"><strong>In terms of influences for your generation, how big was the Garden City Movement? Were these cities seen as just something from the past?</strong></p>\n<p class=\"govuk-body\">No, I don’t think so. They were an inspiration. There was a lot of argument about the garden cities. Some people thought that the densities were too low; that they were romantic cottages. That wasn’t the essence of Howard’s message. Howard really did start the movement for self-contained communities where people could find most of what they needed for a decent life. It was always easy to get from the periphery of the town to the centre, and it was also easy to get out into the countryside. These were Howard’s ideas, and I think that they are still valid. It certainly influenced the New Towns movement.</p>\n<p class=\"govuk-body\"><strong>A book I’ve been reading recently is Lewis Mumford’s The Culture of Cities. How much of an influence was that book upon your thinking?</strong></p>\n<p class=\"govuk-body\">It was one of the books that influenced me personally. I can remember now finding it on the shelf of the public library and thinking, ‘God, this is just what I’ve been looking for.’ It’s great stuff from Mumford, but philosophically he’s very idealist. He sees everything as ideas; he doesn’t understand the social basis that results from economic changes. But nevertheless it is very stimulating stuff; he’s one of the few people who thought about cities in their totality and what they mean to people. I would certainly say he was one of the inspirations.</p>\n<p class=\"govuk-body\"><strong>Was there any awareness of town planning in other parts of the world, or do you think that British town planning was very insular then?</strong></p>\n<p class=\"govuk-body\">I think British planners considered themselves in the vanguard, and I think they were. A lot of ideas carried out in Scandinavia, for instance, were originally from this country. In fact, they did it better. Some of the satellite towns around Stockholm were of a superior design.</p>\n<p class=\"govuk-body\"><strong>Was there much of a cross-over in ideas and experience between different building projects?</strong></p>\n<p class=\"govuk-body\">All the New Towns look very much alike. They were designed much of the time by the same type of people – young and enthusiastic architects. There was quite a bit of exchange of information and ideas. The Ministry did have quite a big section dedicated to the New Towns. This was staffed by sociologists, economists and planners, and they used to have meetings that I used to attend on behalf of Crawley. It was there that people from all the other New Towns exchanged ideas; it was quite stimulating.</p>\n<p class=\"govuk-body\"><strong>Did you feel at the time that this building phase was going to last? Did you think that this was the future of national building?</strong></p>\n<p class=\"govuk-body\">I was aware of it because I was a Marxist in the Communist Party, with a thorough analysis of society. I was very much aware that, although the New Towns were successful, their example wouldn’t be followed because a, it was too expensive, and b, they were too successful. It was showing people what they could do if organised together in an efficient way.</p>\n<p class=\"govuk-body\"><strong>You were obviously influenced by radical political ideas. Do you think your fellow planners were motivated politically?</strong></p>\n<p class=\"govuk-body\">Absolutely. Not all of course, but the majority of planners viewed the New Towns as a political experiment. They really believed that they were creating a better future. A lot of them were very starry-eyed about it. They thought that if you simply gave everybody a decent house and a decent environment then they would be changed, but of course it doesn’t work like that. They are still being exploited.</p>\n<p class=\"govuk-body\"><strong>How much room for tenant participation was there in the running of the New Towns?</strong></p>\n<p class=\"govuk-body\">There was practically none. It brings in the question of paternalism. Even the progressive people, and there were many of them involved, tended to very much take a paternalistic attitude towards matters. I call it a Fabian attitude of ‘the experts know best’ – we want to give you a better life, but we’ll tell you how it’s going to be done. There was very little conscious effort to encourage tenant participation. It was all very well organised when people were thinking of moving to the New Towns: they brought the workers down in coaches for the weekend, they gave them lectures on the plans, they showed them the different house types. And this was all very good, but they didn’t ask them what they wanted. The participation came from below; it came as a consequence of political campaigning by the Communist Party, the Labour Party. They were all very active in pressing the government to do the things that they promised, such as building the hospitals, the schools, etc.</p>\n<p class=\"govuk-body\"><strong>In recent new government building plans, the New Towns phase has been completely looked over. Why do you think this is?</strong></p>\n<p class=\"govuk-body\">It’s mainly because of the whole privatisation stamp of this government: private is good, public is bad. The essence of the New Towns is that they were public enterprises. There was a lot of private capital involved but public authorities coordinated the thing, and once you start talking about that, this is out. The Town and Country Planning Association [TCPA] – the successor to Howard’s Garden City Movement – are currently calling for the building of New Towns.</p>\n<p class=\"govuk-body\">They are lobbying very hard to have the new forms of developments as New Towns, and they are saying that only by setting up Development Corporations can they do this. The Act is actually still on the statute book so there’s nothing to prevent the government from doing this, but it is very much against the way that this government approaches matters.</p>\n<p class=\"govuk-body\">The other issue that the TCPA mention but are not pushing is the thing that was very close to Howard’s heart, which is getting the increased land value for the benefit of the community. This of course is a major political issue. At the moment, you buy land and you buy it at the value for development. If you buy development land it is very expensive. Under the New Towns Act 1946, the land was bought at its existing use value – so, if it was a farm it was bought for the price of agricultural land – but the Tories changed that at some time in the 1950s. That is a major factor that makes a hell of a difference.</p>\n<p class=\"govuk-body\"><strong>What lessons can be drawn from the New Towns for today’s planners?</strong></p>\n<p class=\"govuk-body\">They proved that you can create better conditions – for all their deficiencies, they were still better places to live in than the average council estate. They still are. When I go back to Crawley now I think, ‘This is a good place to live.’ So they are a vindication of planning. They are also a vindication of public authority, with the powers, and to some extent the money, to do a job. You can make criticisms that they were not democratically accountable, not accountable to the local people, but that is not a problem that is capable of solution. The sort of people that were appointed to the boards of the Development Corporations were mostly businessmen, with a few right-wing Labour councillors chucked in for good measure. Their main aim was to provide a profitable field for capitalist enterprise – there is no doubt about that. The chairman of the Crawley Development Corporation was a guy called Sir Thomas Bennett, who was an architect and then a big business architect, and whose clients were industrialists. He used to give an annual report, and the main point he made was that the industries were saying that they were making more profit in Crawley.</p>\n","id":"I587MC32DQftMNs6yyoL1"},"__N_SSG":true}