{"pageProps":{"title":"The Harold Hill Tenants’ Association","contentRichText":"\n<p class=\"govuk-body\">Tenants’ Associations, and their organisers, have often played quiet roles and battled on with little recognition for the part they have played in local areas. Occasionally, such as in the late 1960s and the late 1980s, they have effectively united together in national or London-wide campaigns, but tenant leaders have for the most part found themselves battling on in isolation and without applause. On the whole, working-class activists led the Tenants’ Associations, and despite a lack of formal education they exhibited a flair for leadership and organisational ability.</p>\n<p class=\"govuk-body\">The first incarnation of the Harold Hill Tenants’ Association sprung up with the prefabs in the late 1940s. The issues raised on behalf of members were typical of those to be found on a new estate such as Harold Hill – the lack of transport for children schooled miles away and the need for a nursery school. Other complaints aired regarded the lack of pavements (which forced children to walk in the road) and school meals that often only had vegetables (without the ration-quota of meat).</p>\n<p class=\"govuk-body\">Social events were an important aspect of the Tenants’ Association organisation. A typical event was that organised in the autumn of 1949 at the Harold Wood War Memorial Hall, where over 100 people gathered to dance to The Blue Ravens led by Ted Scott. The MC was the Tenants’ Association’s secretary. At these events, the children of estate residents were always catered for so that parents could enjoy a night out at the end of the week.</p>\n<p class=\"govuk-body\">Much of the work of any Tenants’ Association is often low-key and outside the glare of publicity. Occasionally, though, they do make the headlines, as happened in May 1952 when nearly 200 children were involved in a ‘school strike’.</p>\n<p class=\"govuk-body\">Parents were unhappy at the free school bus being withdrawn from those attending Heath Park Girls’ School and Pettits Lane Boys’ School. A meeting of mothers took place on Tuesday in the field behind the works canteen of C.C. French – a common meeting place for Harold Hill tenants before the community centre was built. One-hundred women decided to form a strike committee and sent a deputation to Chelmsford, where the Essex Education Committee was based. They visited the deputy education officer for Essex and handed in a 650-names-strong petition, but they were disappointed when he refused to reinstate the free transport.</p>\n<p class=\"govuk-body\">After this setback, the fathers became involved too and another deputation was organised. This deputation went to the House of Commons to see the Romford M.P., Lt.-Col. J.C. Lockwood. He refused to see them.</p>\n<p class=\"govuk-body\">By Friday the strike had spread, with more parents pulling their children out of school and 200 gathered in the same field where Tuesday’s meeting was held to decide upon their next move. A Parents’ Strike Committee was formed, with Mr C. Grutt as secretary and Ben Cohen as press officer, while tenants from the nearby Theydon Bois estate came to offer advice, having themselves just recently undertaken similar action on the same issue. The press officer read out the following statement to waiting journalists:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘First, the people have decided as a result of the meeting to stand together until free transport is provided. The whole action is concerned with the welfare and education of the children.'</p>\n</blockquote>\n<p class=\"govuk-body\">On Thursday, Romford Trades Council passed a resolution giving us their support.</p>\n<p class=\"govuk-body\">Children who have to take a scholarship are going to school under protest, but they will come out when their examinations are finished.’</p>\n<p class=\"govuk-body\">Every morning hundreds of ‘striking’ kids would be lined up and the registration would be taken. They waited by the same bus stop at the same time for the transport necessary to get to school. The tenants’ stand was clear: here are our children ready to go to school, now send a bus to pick them up.</p>\n<p class=\"govuk-body\">They won the battle: the authorities caved in a month later and conceded the need for free transport.</p>\n<p class=\"govuk-body\">The Harold Hill Tenants’ Association was re-launched several times between the late 1940s and the late 1960s, but it was to be permanently launched in 1968 after the newly elected Tory majority on the Greater London Council (GLC; the renamed and expanded LCC) decided to increase rents by 70 per cent under the pretence of a budget deficit. Harold Hill, like many places in London, responded by holding a demonstration in which 200 people marched around Central Park. This was part of a London-wide campaign that accumulated in 6,000 demonstrators marching to the Hampstead home of the Minister for Housing, Tony Greenwood. Unsurprisingly, Greenwood reacted to this by intervening and blocking the proposed GLC rent increases.</p>\n<p class=\"govuk-body\">The new Tenants’ Association had two aims: to oppose present and future rent increases; and to secure higher standards of estate management and repairs to, and maintenance of, maisonettes, flats and houses on the Harold Hill GLC estate.</p>\n<p class=\"govuk-body\">From this re-launch came a Tenants’ Association that lasted up until the 1990s, when it imploded with infighting. It was, reputedly, the largest Tenants’ Association in London by the turn of the 1980s. Other activists came to the fore during its existence, in particular the Battling Bettys – Betty Strathern and Betty Whiting.</p>\n<p class=\"govuk-body\">Mike Davies, a prominent activist in the 1980s, remembers how they gained their nickname:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘They were known as the Battling Bettys because people used to go to them when they were in trouble. Betty Strathern was astute, very articulate and could put a letter together. When I was Chair of Housing I looked at her file and whereas most tenants’ files are an inch thick, hers was a foot thick.’</p>\n</blockquote>\n","id":"2TyTKVdZw7DDw9UsjjENTm"},"__N_SSG":true}