{"pageProps":{"title":"Hippies, Freaks and the Summer of Love","contentRichText":"\n<p class=\"govuk-body\">As the 1960s progressed, so too did fashion. Scooters were quickly becoming obsolete, together with those that rode them (the mods). Coming from the West Coast of America was a new youth movement: the hippies, also called freaks or heads. Common legend has it that the scene was based upon sex, drugs, music and politics; some of these were undoubtedly features, but not necessarily all at once – unless you were in some kind of jet-setting rock group.</p>\n<p class=\"govuk-body\">Geoff Maynard, a former juvenile mod, remembers how the hippie movement gradually took hold of the imagination of Harold Hill youth:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘Certainly DJ John Peel and co had a hand in promoting the new movement by playing Buffalo Springfield, the Incredible String Band and other weird music away from the mainstream Motown and soul sound. Then Jimi Hendrix and the Stones started popularising the real longhair, scruffy image as opposed to the clean-cut Beatles look. We followed the music, and the bands were our guides – the longer the hair, the cooler the look. It wasn’t overnight. Our hair was cropped as Mods, but then we started to copy the style of the bands. Look at the old black and white tapes of Ready Steady Go! – that was our window into what the bands were wearing.</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">The hippie movement is well documented as being the first middle-class youth subculture, so I guess we working classes followed where they led. I noticed it coming from the art colleges first.</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">Though we frequented the Marquee in the Mod days, we then changed over to the Temple in the hippie days – both were situated in Wardour Street. Once the hippie thing caught on the allure of the all-nighter love-ins – as festivals were called then – took over. We were at the early ones in the Alexandra Palace. Most of us didn’t have a clue about Vietnam or politics of any sort – we just followed the music and the dope. I got Jimi Hendrix to autograph his drummer’s broken drumstick, and then swapped it an hour later for a bag of grass!’</p>\n</blockquote>\n<p class=\"govuk-body\">For the heads, those that still clung to scooters and Bank Holiday punch-ups were relics, deadwood, history. Things had moved on: music and fashion. This was where it was happening. Even the language changed, with ‘cool’ meaning themselves, and ‘straights’ referring to everybody else.</p>\n<h2 class=\"govuk-heading-m\">The summer of love in Romford</h2>\n<p class=\"govuk-body\">The public and the press once again became interested in a new movement. Del Smith witnessed the closest Havering came to its own ‘summer of love’ in 1967:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘There was a “love-in” in Raphael’s Park, a big “love-in”, where people blew up condoms and patted them around, but nothing happened. It was organised by Cornelius, Romford’s only hippy. I turned up and there were about 5000 sightseers. It was pandemonium, there were traffic jams with everybody making their way to this “love-in” because the Romford Recorder had run a story on it. There was Cornelius with longhair and an Afghan coat with a couple of women, and that was it. But there were thousands of people all trying to see what was happening, it was chaos.’</p>\n</blockquote>\n<p class=\"govuk-body\">With the hippie movement came a greater inclination for the kids to become involved in running their own events. There was a DIY ethos as highlighted by Paul Summers, who ran a group called HARP that was made up of pupils from Harold Hill Grammar School. In the early 1970s, they approached the local authorities to put on free gigs in Havering – open-air concerts being very fashionable at the time:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘There was this committee, made up of very elderly people. They used to meet in this old people’s home, and some of them were ancient, they were resident in the care home, but others were working class blokes in their fifties. And we approached them with the intention of putting on a gig in Raphael’s Park. And still today I’m astounded that they agreed to it because we didn’t have a clue what we were doing – bear in mind that we were 17 or 18. But they agreed to it, and eventually we put on two very successful gigs in the park.</p>\n  <p class=\"govuk-body\">We also put on gigs at the Windsor free concert every year that ran from 1970 until 1975. In one year, 1973, the police tried to break up the concert but they were repulsed. They came driving into the area in a wagon, which they crashed and was then turned over by the crowd, and they were told in no uncertain terms to get out or else, which they did – this was the days before the mass police charge with truncheons drawn. A couple of years later though they had their revenge and really smashed the site up.’</p>\n</blockquote>\n<p class=\"govuk-body\">Spyder Curphey, the bass player from the band Castle Farm, also used the knowledge he gained from playing live to host his own events:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘My brother and me started a blues club at The Castle in Brentwood. A lot of people would either go to Romford and the White Hart or to Brentwood to drink.</p>\n  <p class=\"govuk-body\">The heads, the musos, used to go to the White Horse, which is where KFC is now. We fell out with the owner because he used to water the beer down. So we went mob-handed over to The Castle. It was a real straights place, but there was a young couple that had just taken over, and we never went back to the White Horse. They had a nice little room in there and I used to use Castle Farm’s gear and we’d invite musicians from all over Essex to come and just jam. We put the backline in and drums and it was really successful – soon we had 500 members. It was Monday night because we knew we wouldn’t have a gig elsewhere and also we knew that others were unlikely to be doing anything else. The governor was really pleased because Monday night was his busiest.’</p>\n</blockquote>\n<p class=\"govuk-body\">Del Smith, with others, was instrumental in organising a free gig in Bedfords Park in 1972. They were given the responsibility for writing the publicity brochure, and they duly obliged by writing an article entitled ‘All coppers are bastards’:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘There was an article written in there by John Simkin called “All coppers are bastards.” Anyway, it was the early hours of the morning and we were sitting in my flat stoned, and suddenly there was this almighty thumping on the door downstairs. Straightaway we thought that it was a police raid, so we panicked and I eventually opened the door and it was this councillor John Riley. He goes, “I’ve just been to the police station and they say they are going to raid your house.” So I said, “Why?” “Well I’ve shown them the brochure for the concert.” So I’m like, “You cXXX!”</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">Councillor Riley went into the police station and said, “What do you think of this?” They said, “If you print this you’re going to be arrested.” He was banging on my door at one in the morning. He frightened the life out of me, I thought it was the police. He was terrified of the article.</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">Then we were disowned by the people who were running the concert, which was an Albemarle-based committee made up of a few youth workers, a few councillors and a few youths.</p>\n  <p class=\"govuk-body\">The youths did all the organising, the finance was from the council, the magazine was written by us.</p>\n  <p class=\"govuk-body\">Riley got hold of it not long before the end, and said, “You’re all going to get busted.”</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">Then he said, “You can’t print it with that in it.”</p>\n  <p class=\"govuk-body\">So we said, “FXXX you, we’ll do our own. We’ll produce our own magazine and sell it at the concert.”’</p>\n</blockquote>\n<h3 class=\"govuk-heading-m\">Altamont at the Albemarle</h3>\n<p class=\"govuk-body\">If the early 1970s gig at Bedfords Park was Harold Hill’s Woodstock, then the ‘cannon incident’ at the Albemarle in 1972 was Harold Hill’s Altamont, as Curphey remembers:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘It was a Sunday concert with four or five bands in the afternoon. One of the bands was called Storm and they had this cannon which they fired sweets from into the audience after putting gunpowder into it. The people at the Albemarle wouldn’t let them set it off which was just as well because they took it outside and set off in the car park and it blew up – and with it their rodie as well. His guts were hanging out everywhere.</p>\n  <p class=\"govuk-body\">I was in the back room of the Albemarle tuning up with the other members of the band. We were having a little jam when suddenly there was this almighty explosion and all the glass was blown in on our heads. Of course we all ran out and being in the back room we were the first ones there. The rodie was in a really bad state but a couple of other people were badly hurt and they took them away to hospital.’</p>\n</blockquote>\n<p class=\"govuk-body\">Paul Summers was an organiser on that day:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘The rodie of the band Storm had made this cannon that fired sweets into the audience. And the main youth worker at the time, Arthur, asked them to take it outside just so that he could test whether it worked properly, it was nothing to do with health and safety, he just wanted to see if it worked. This rodie that made it used a mixture of sugar and weed killer as explosive, and the taper was a piece of string soaked in wax – really primitive stuff. So he lit it, and the whole thing split open like a banana. It injured him and seriously injured a few others as well as blowing out the windows of the youth club and the windows of the bands’ transit vans.</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">The main youth worker, Arthur, was deaf for a couple of years afterwards. In fact, he never really talked to us again.</p>\n  <p class=\"govuk-body\">I came home at one in the morning and the Express and Daily Mail had rung my parents asking whether I was still alive. It being the days before mobile phones you could imagine what they were going through.’</p>\n</blockquote>\n","id":"6HqgZqmFW9sj1D2gqyYYtY"},"__N_SSG":true}