{"pageProps":{"title":"Mods: Fire ‘n’ Skill","contentRichText":"\n<p class=\"govuk-body\">The most distinct and influential of all the British youth movements were the mods. Mods – an abbreviation of ‘modernists’ – were the epitome of the 1960s. Stylish, ultra-cool, ultra-modern, subversive and narcissistic, the movement began with a few Jewish kids in Stamford Hill at the beginning of the decade; wealthy and clothing-conscious, they did little but pose and spend money on the latest fashion. Somehow the style spread, and with it came the new sound from America – soul, typified by the Motown label.</p>\n<p class=\"govuk-body\">George Baker, one of the original Harold Hill mods, noticed the style transformation early on:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘I noticed the change in fashion in school as early as 1960. It was still in the tight trousers and winkle-picker era, and one or two of the lads were wearing baggier trousers. I left school in 1961 and within a year of that a new fashion was really taking hold of London.’</p>\n</blockquote>\n<p class=\"govuk-body\">The mods were interested in one-upmanship; they had to have the latest change in style before any of their peer group. Those that reached the top of this fashion ladder – presumably those with the most access to cash – were called ‘faces’. Although trends changed rapidly, there were some common denominators: the tonic suit, traditionally three-buttoned; Harrington jackets, Sta-Press trousers and Levi jeans coming onto the scene via cash-strapped black American GIs in West End clubs; mohair suits and Cuban-heeled shoes from the Italian lads; quasi-military attire such as parka jackets, suede desert boots and RAF t-shirts; pork pie hats from the West Indian rude boys; the essential American-style button-down shirts (which at their most expensive were from Brooks Brothers, with Ben Sherman for the rest); and splashes of colours everywhere, such as white jeans with a pale yellow shirt, or perhaps a blue, striped or chequered shirt. Even more important was the attention to detail, which changed with pace: maybe one week it would be a six-inch vent on the suit jacket, while the next week might see an eight-inch vent, bowling shoes or perhaps a feather in the cap. The variations in style were not noticeable to the ‘outsider’, but they mattered to the in-crowd.</p>\n<p class=\"govuk-body\">George Baker expanded on mod style:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘When the Mods first came out we didn’t wear parkas and all that. I used to have a leather coat that I wore while riding my scooter. Clothes were more important than music – for me particularly, but I think it was the same for most people. It was mohair and tonic suits, and I had quite a few of those. We used to go to a place called Lew Rose in Romford who was a tailor and he used to get our suits made up. We used to buy them on the tick and pay for it weekly.</p>\n  <p class=\"govuk-body\">I never wore a pork pie hat. To me they were a badge of servitude, which you either doffed or saluted. Everybody would wear a suit at the weekend and be smartly dressed. When I look at the younger generation today they haven’t got a clue – they may spend more money but the effect is nowhere near as dramatic.’</p>\n</blockquote>\n<p class=\"govuk-body\">Keith Simpkins was one of the early modernists from the estate:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘I was a little Mod in Harold Hill and I started when I was 14, 15 years old, which was around 1960, ’61.</p>\n  <p class=\"govuk-body\">Brenda Collins in Romford was the place to buy clothes. It used to be at the top of Romford market. The bloke that used to run it was a right budding entrepreneur. He had about eight outlets; he had one in Oxford Street as well. He used to listen to what we wanted, and then he would go and get it. Jackets without any collars, shirts with button down collars, what colour you wanted, and within a week or so he would have it in stock.</p>\n  <p class=\"govuk-body\">People used to take the mickey out of us all the time, if you wore a pink shirt you were considered a poofter. People like your parents, or your mates parents, if you turned up around their house with a pink shirt – you’d have the rise taken out of you.’</p>\n</blockquote>\n<h2 class=\"govuk-heading-m\">Lambretta and Vespa scooters</h2>\n<p class=\"govuk-body\">The influence of Italian culture at this time was strong. After the Second World War, nearly half a million continental soldiers either chose to remain in Britain or were forced to because of the impossibility of returning to Soviet-dominated Eastern Europe. By 1950 they numbered 429,329, of which 162,339 were Polish, with thousands more Ukrainians, Estonians, Latvians and Lithuanians. There were also 1,000 former Italian POWs, which, when added to the pre-war resident Italian population, constituted a significant section of the British population. As time moved on, their children – part Italian and part Anglicised – played a notable part in the burgeoning style movement.</p>\n<p class=\"govuk-body\">In Italy itself, the influx of the anti-Communist American dollar meant an explosion in manufacturing and design, a legacy that is still felt today. Out of Milan came the motor scooter. Originally designed jointly by Corradino D’Ascanio and Ferdinando Innocenti, these two quickly parted and went separate ways, the former joining the Piaggio company (which created the Vespa), with the latter creating the Lambretta (which was named after the region in Milan where it was produced).</p>\n<p class=\"govuk-body\">The Lambretta ‘A’ was unveiled at the 1947 Paris Motor Show and went on sale soon after. The scooter was built as a practical means of transport – it was easy to ride and economic with fuel – but by the early 1960s it was to become a fashion accessory, as these former Harold Hill mods remember:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘I had a scooter. I remember the first time I saw a scooter on the street and I didn’t like it. But one day I came to the conclusion that motorbikes were horrible, dirty and reactionary and people who rode scooters were fashionable and progressive. And essentially for the time we were progressive.’</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘The scooters were “graded”. The more powerful, the better. A Lambretta was a LI 125cc, which was poor, an LI 150cc, which was okay, a TV 175, which was good, or a GT 200, which was the best. Vespa’s were 150’s models generally but I think there was a 200 as well. People were either Vespa or Lambretta fans. The engine side-covers, “Panels” on a Lambretta or “Bubbles” on a Vespa, were often chrome-plated, usually at the chrome-plating works on the Harold Hill engineering workshop, next door to the Lovable Brassiere factory. There was usually a Mod or two working at the engineering shop who would do it as a back-door job.’</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘We used to go to Redding Court night school in the evening. There were quite a few Mods on scooters there, and one of them taught me how to ride a scooter in the grounds of Redding Court school. And on my sixteenth birthday I went out and bought a scooter. The scooter I got was a TV 175, but most kids at the time were riding Vespa GS.</p>\n  <p class=\"govuk-body\">I paid £75 which doesn’t sound a lot, but I was only 16 years old which was a lot of money. It was all hire-purchase from a place in East Ham.</p>\n  <p class=\"govuk-body\">You only got a scooter because you were 16 or 17 and it was a way of getting around. At 17 you rode a car, you wore exactly the same style but instead of meeting in scooters you would meet in cars.’</p>\n</blockquote>\n","id":"5ky7KLMeGArNVOPceniOzt"},"__N_SSG":true}