{"pageProps":{"title":"‘More Crime Here Than in Liverpool’ – Romford Times, 29 July 1953","contentRichText":"\n<article class=\"article\">\n  <p class=\"govuk-body\">Chief Supt. A.E. Ruggles, Romford’s police chief, speaking at Havering last week, said that 4,000 crimes a year committed in the Romford police division was more than the number of crimes committed annually in the city of Liverpool.</p>\n  <p class=\"govuk-body\">Note: Romford police division covers the Borough of Romford and the Urban District of Hornchurch, having a combined population of 220,000. Strength of the force in the division is under 250 men. The Liverpool police force serves an area with a population of 802,300. Strength of the force is 2,293.</p>\n  <p class=\"govuk-body\">The Superintendent said that when he first came to Romford 33 years ago the police force then consisted of a superintendent, an inspector, three sergeants and 30 men. Now there was a chief superintendent, four chief inspectors, seven inspectors, 20 sergeants and over 200 men.</p>\n  <p class=\"govuk-body\">‘There is more crime in Romford – 4,000 crimes a year – than there is in the City of Liverpool, so you see that we have plenty to do.’</p>\n  <p class=\"govuk-body\">He then went on to say that the village would soon be losing its constable because the county police authorities had to give up his house.</p>\n  <p class=\"govuk-body\">‘Don’t think there is any question of neglecting Havering. The police will be able to reach you in a few minutes if you need us,’ he said.</p>\n  <p class=\"govuk-body\">(This article is referring to the village of Havering-Atte-Bower, not the London Borough of Havering.)</p>\n</article>\n<p class=\"govuk-body\">One resident remembers how she delighted in taking revenge against her complaining mother-in-law:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘When we moved here there was much prejudice, especially from Gidea Park.</p>\n  <p class=\"govuk-body\">I married a bloke from there, much to his mother’s disgust.</p>\n  <p class=\"govuk-body\">The press was extremely biased and every little thing that happened on Harold Hill would make the front page. When I was twenty I worked for CID in Romford and my mother-in-law lived in Gidea Park and she was always going on about Harold Hill and what a terrible place it was and there were all these villains coming out of London. And I had great pleasure, because I hated her at the time, in going through the records at CID and finding out that there was more crime in Gidea Park and Romford than there was in Harold Hill and which was never published.’</p>\n</blockquote>\n","id":"6HeOksAuWZeW9Dwru1NEp1"},"__N_SSG":true}