{"pageProps":{"title":"New Housing Estate ‘Not Second Dagenham’ – Romford Times, 17 October 1945","contentRichText":"\n<article class=\"article\">\n  <p class=\"govuk-body\">There would be no question of ‘rows and rows of houses’ in the new estate in Romford, said Alderman F.L.J. Cole, at Romford Ratepayers’ and Residents’ Association meeting at Wykeham Hall, Romford, on Monday.</p>\n  <p class=\"govuk-body\">Alderman Cole was replying to a query by Mr P.W. Clayton, who stated that when the new estate was built, roads, education and other services would become a burden on the Council. The type of people coming to Romford were the type of people who would become a charge on the rates – would the whole matter become a repetition of Dagenham?</p>\n  <p class=\"govuk-body\">Almost A Utopia!</p>\n  <p class=\"govuk-body\">Alderman Cole replied that in view of the general concern of the town, it was time the idea that another Becontree would be in Romford was dispelled. Members of the council were assured in conversation with L.C.C. that the design, number to the acre being built in Loughton first would conform to town planning on paper and in spirit.</p>\n  <p class=\"govuk-body\">The wooden part of Dagnams Park would be reserved, houses would be built at a low density, and would be split with open spaces, trees, shops, and pubs.</p>\n  <p class=\"govuk-body\">Romford must remember that L.C.C. came to Council in the position of private landlord, though the Council was assured they would get greater cooperation from them than from private builders.</p>\n  <p class=\"govuk-body\">Other members expressed their opinion on the matter, Councillor Lucas declaring that if Romford was the only available place for the estate to be built, he was glad of it. The people coming there had as much right to a roof over their heads as Romford folk.</p>\n  <p class=\"govuk-body\">Lt-Comdr. Newman Eyre said that if planning was of a high order he thought that type of development better than some in Romford today.</p>\n  <p class=\"govuk-body\">Councillor G.F. Chaplin said he thought if the new estate was built with wide boulevards it would be an improvement to Romford. He would support the idea of a green belt between Romford and the new estate.</p>\n</article>\n","id":"3hBsvp0FdViUBQjjEVPWhD"},"__N_SSG":true}