{"pageProps":{"title":"Now We Must Rebuild: The Greater London Plan, 1944","contentRichText":"\n<p class=\"govuk-body\">The significance of the Greater London Plan, 1944 cannot be underestimated.</p>\n<p class=\"govuk-body\">Frederic J. Osborn was a colleague of Ebenezer Howard and worked on both Letchworth and Welwyn Garden City. He became closely involved with Howard’s successor organisation, the Town and Country Planning Association, from the mid-1930s onwards and was to play an instrumental part at the heart of government in instigating the New Towns plans.</p>\n<p class=\"govuk-body\">In a way of passing on the lineage, he spoke highly of Patrick Abercrombie’s ability:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘I have for years worked very closely with Patrick Abercrombie, and it was largely through him that we were able to get the Barlow Royal Commission to come down on the side of decentralisation, limitation of city growth, and the national control of the location of industry. Abercrombie is the only philosophic or sociological planner in the country; and he is also the recognised head of the profession, his prestige has, with the new fashion for planning, risen to great heights.’[^1]</p>\n</blockquote>\n<h2 class=\"govuk-heading-m\">World War Two: From destruction to new construction</h2>\n<p class=\"govuk-body\">In 1941, the Minister of Works and Buildings asked the LCC to prepare a plan, which became the County of London Plan 1943 – the proto report for the later Greater London Plan 1944, which was commissioned by the same Ministry in 1942.</p>\n<p class=\"govuk-body\">It was a bold plan: the first attempt since the Industrial Revolution to fundamentally get to grips with London’s inordinate problems and, what’s more, to bring all aspects of society – housing, transport and industry – under the one roof of a single strategy.</p>\n<p class=\"govuk-body\">The need for such an endeavour was unarguable. Whole swathes of London, and in particular the dock areas such as West Ham and Canning Town, had received substantial bomb damage. The East End of London was labelled by the Luftwaffe as Target A – the main focus of bombing campaigns – because of the strategic value of its industry.</p>\n<p class=\"govuk-body\">The first bombing raid happened on 7 September 1940, and the last Vergeltungswaffen-1 (or ‘doodlebug’) fell on 27 March 1945. In between, this area of London took a pounding – the only positive outcome of which was the resulting slum clearance.</p>\n<p class=\"govuk-body\">The greatest intensity took place at the beginning of the hostilities. In the latter years, the bulk of the attack was concentrated on other towns such as Coventry and York. Even so, it has been calculated that, between the first and last wartime incidents, the air raid sirens wailed 1,224 times. That is, Londoners faced an aerial attack once every 36 hours over a five-year period.</p>\n<p class=\"govuk-body\">Hitler’s bombs in World War Two brought destruction, but also the hope of construction.</p>\n<p class=\"govuk-body\">From the wreckage sprang real hope. As the Liberal Viscount Samuel noted: ‘The destruction of parts of our cities brings with it some compensation in the opportunities opened. It is obvious that a sudden change back from war to peace will threaten an economic crisis. Immediate employment on a vast scale in re-planning and building to make good the destruction, to catch up arrears of normal building, and to effect the improvements so plainly necessary – would offer the best means of meeting it.’[^2] Every political persuasion saw the necessity of rebuilding, which left an opening for somebody such as Patrick Abercrombie to fill.</p>\n<h3 class=\"govuk-heading-m\">The Greater London Plan in detail</h3>\n<p class=\"govuk-body\">The key to the Greater London Plan, 1944 was the movement of people away from the central London areas (chiefly, those under the control of the LCC) and into the newly built areas, which were called the New Towns. The London of tomorrow was divided into four rings: Inner, Suburban, Green Belt and Outer Country. These stretched from the centre of London out to Brentwood and Billericay in Essex, Luton in Bedfordshire, High Wycombe in Buckinghamshire, Sevenoaks in Kent and Farnham in Surrey. At the furthest parameters were the New Town developments of Basildon and Harlow.</p>\n<p class=\"govuk-body\">The movement of people was to be massive: 618,000 from the LCC-controlled area, and a further 415,000 from areas adjacent. A total of 1,033,000 people were to move away from the centre of London and into the brave new world of post-war planning.</p>\n<p class=\"govuk-body\">London has always had a transient population, and by the outbreak of war it was estimated that 60 per cent of residents had been born elsewhere, with most coming from the north of England, Ireland and Eastern Europe. The population between 1919 and 1936 grew from 4,034,900 to 6,117,300: an increase of over two million.</p>\n<p class=\"govuk-body\">At the same time, the inner-London area covered by the LCC shrank in size by 502,000 persons. The new areas of residential growth were in the suburbs: the massive Becontree estate in Essex, and the rapid expansion of Hornchurch and Upminster from villages into well-populated extensions of the commuter belt.</p>\n<p class=\"govuk-body\">The 1944 Plan gives little charity to the pre-war housing expansion, either private or local authority: ‘the Outer London built between the wars was in the main a terrifying waste of unsocial dwellings.’[^3] In the cases of Hornchurch and Upminster, this meant ‘examples of much that is the worst that can be carried out under pre-war statutory planning powers’.[^4] As for Becontree in Dagenham, its ‘sociological problems’[^5] were only mentioned in passing.</p>\n<p class=\"govuk-body\">The New Towns were to have a maximum of 60,000 inhabitants, and these were to be divided into neighbourhoods ranging from 5,000 to 10,000 people each. They were to be established in the Outer Country ring, and were identified in the Plan as being at White Waltham in Berkshire; Chipping Ongar, Harlow and Margaretting in Essex; Stevenage, Stapleford and near Redbourn in Hertfordshire; near Meopham in Kent; and Crowhurst and near Holmwood in Surrey. But with these would be a dispersal of population to already existing towns, such as another 30,000 to Ashford in Kent and 20,000 to Chelmsford and Witham in Essex.</p>\n<p class=\"govuk-body\">The population density of Central London would, in the process, be reduced to 136 persons per acre – down from the then high point of 200 persons per acre.</p>\n<h4 class=\"govuk-heading-m\">The Green Belt as integral to the Plan</h4>\n<p class=\"govuk-body\">The Green Belt ring – in which Romford was situated – was to be left as much untouched as possible in order to leave land for both the recreational use of town dwellers and agricultural purposes; however, this area was to be the subject of some new developments, referred to in the 1944 Plan as ‘moon satellites’ or ‘quasi-satellites’.</p>\n<p class=\"govuk-body\">It was necessary to host these new residential areas in the Green Belt ring so that there could be an immediate short-term relief on the dire housing shortage in the Inner ring. It was these areas, housing no more than 125,000 people, that were to be built first. One earmarked site was mentioned in the Plan:</p>\n<p class=\"govuk-body\">‘Harold Wood, largely in Hornchurch U.D., is a suburb consisting mainly of small houses based on the station with a small shopping centre. It is now virtually joined to Romford. East of Harold Wood there is a pleasant belt of open hilly country. One of the projected quasi-satellites will be situated near Dagnam Park, part of which should be kept as Green Belt; it will be separated from the station by the main Roman Road, which should be partially sunk in a cutting to allow for easy passage for local traffic over the top of it by bridges to connect with the new satellite.’[^6]</p>\n<p class=\"govuk-body\">This is the paragraph from which Harold Hill sprung.</p>\n<p class=\"govuk-body\">[^1] F.J. Osborn, letter to Lewis Mumford, 7 December 1943. The Letters of Lewis Mumford and Frederic J. Osborn – a Transatlantic Dialogue 1938–70. (1st ed.) New York: Praeger Publishers</p>\n<p class=\"govuk-body\">[^2] Introduction to F.J. Osborn, Overture to Planning (Rebuilding Britain Series No. 1); The Land and Planning (Rebuilding Britain Series No. 7), London: Faber &#x26; Faber, 1941.</p>\n<p class=\"govuk-body\">[^3] Greater London Plan, 1944, p.17.</p>\n<p class=\"govuk-body\">[^4] Greater London Plan, 1944, p.134.</p>\n<p class=\"govuk-body\">[^5] Greater London Plan, 1944, p.133.</p>\n<p class=\"govuk-body\">[^6] Greater London Plan, 1944, p.135.</p>\n","id":"49DC9U0ISBznSXhKHkCrAC"},"__N_SSG":true}