{"pageProps":{"title":"Prejudice from the Rest of Romford","contentRichText":"\n<p class=\"govuk-body\">Few in the surrounding areas warmed to the new influx, with estate tenants complaining that they were being snubbed by bus drivers and that shop assistants were refusing to accept cheques. Crime in Harold Hill was being reported every week in the local papers, with local residents quickly becoming exasperated with the coverage they were receiving.</p>\n<p class=\"govuk-body\">Here are some comments from a 1951 Romford Times edition – all from different Harold Hill residents – as printed in response to the criticism:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘I feel that as a resident of Harold Hill I must write to you about your vindictive and insinuating question mark on the front page of your hitherto-interesting and communicative paper. I realise, of course, that we are not wanted by the residents of this area; but it must be realised that for the most part, we ourselves were compelled by circumstances to reside in this district and, left alone, with a few exceptions, we hope to make this a strong, thriving and happy community.’</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘I think that the people I have come into contact with since I have been here are all most helpful and obliging, to say the least, the neighbourly spirit being well to the fore.’</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘I suggest that you leave those vicious thrusts and direct them towards those human animals who rush off the train at Gidea Park, knocking down and trampling all who are coming down to the platform – even young children.’</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘Give me the humble people at Harold Hill who, for the most part, are happy in their own homes for the first time, and only wish to be left alone.’</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘The council is far too slow in providing recreation facilities here. Youths between the ages of 12 and 17 are too young to have enough money to go into Romford every night and too old to go to bed at 6 p.m. They are either forced to sit in with their parents or hang around on street corners.’</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘Are many of the estate’s residents undesirables? No, all the undesirables live in Gidea Park.’</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘We have some very good people in professions here, good citizens all. In years to come, Essex and Romford will be proud to mention the Harold Hill estate.’</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘At present nothing is right with it, no schools for our children, which means that we have to travel back and forth to Romford and no amusements. We are snubbed when travelling on buses and shops directly you mention you come from Harold Hill.’</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘We have all been placed badly and it’s all wrong. Our children have to go to schools in Romford and are classed as “The Kids on the Hill”.’</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘Owing to the absence of shops, we find the cost of living much too high, therefore encouraging crime.’</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘Growing pains, emphasised by the silly tittle-tattle of alarmists who without any factual knowledge of the extent of crime, see fit to write to their local papers and by doing so create a bad atmosphere.’</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘We need more shops. I have women staggering along roads on the estate looking like beasts of burden with shopping from Romford.’</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘They feel we are putting up their rates, spoiling the look of what was once countryside and getting houses when thousands of Romford people are homeless.’</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘More police are required; but how much crime is the natural result of the almost universal terrible financial position of most tenants? Rents, fares, hire-purchases and the iniquitous cost of living are blameworthy.’</p>\n</blockquote>\n<p class=\"govuk-body\">In response to the ongoing criticism from Romford residents, the chairman of the LCC Housing Committee said this to a meeting of the Gidea Park Ratepayers’ Association in October 1951:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘I want to give you a picture of London’s problems, which are not appreciated.</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">London is a physical mistake, and it should have never happened. It is a wonderful place and I have done a lot of globetrotting, but it is an aggregation of buildings that were just allowed to happen.’</p>\n</blockquote>\n<p class=\"govuk-body\">Citing figures of 200,000 people being on the waiting list, with 60,000 of those being urgent and another 60,000 being very urgent, he said that re-planning London would take 20 years, in which time half a million new houses would be built:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘We have a tremendous slum problem in London, and clearing the slums involved sending people “out-county”. Unless that is done the slums will go on, and there will be a wastage of wealth on traffic problems (!). We will do all we can in London but unless we still come “out-county” the great LCC within three years will cease to exist.</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">The LCC has done its statutory duty, and that is to supply a number of houses, and we intend to do that at any cost.</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">The Harold Hill estate is one of which we are proud.’</p>\n</blockquote>\n<p class=\"govuk-body\">There were many appeals by the local dignitaries and officials for tolerance towards the new Romford residents, but the association between crime and Harold Hill continues to this day. But Romford itself was hardly without fault: the market town was one of the major black market centres during the Second World War, and statistics from 1953 revealed higher levels of crime in the Romford district than those in the City of Liverpool.</p>\n","id":"3n95CGLmMgFqhH1Dlhh4Sr"},"__N_SSG":true}