{"pageProps":{"title":"Protestants, Catholics and the Rest","contentRichText":"\n<p class=\"govuk-body\">The Churches – and also the synagogue and the Jehovah’s Witnesses’ Kingdom Hall – have been a constant presence in Harold Hill right from the early days. The Greater London Plan, 1944 envisaged church facilities for 10 per cent of the New Town population, while Harold Hill’s original plans donated space to six different churches.</p>\n<p class=\"govuk-body\">In fact, during the 1950s there were two Church of England premises built: St. George’s and St. Paul’s, as well as churches for the Methodists, Evangelicals, Baptists and Catholics. The small communities of Jews and Jehovah’s Witnesses also erected their own centres of worship.</p>\n<p class=\"govuk-body\">Although active church membership was limited among adults, for the children it was a different affair, with parents en masse sending their kids to Sunday School – mostly to seek some peace and quiet. Because of the estate’s youthful population, St George’s claimed at one point that it had the largest Sunday School attendance in the country.</p>\n<h2 class=\"govuk-heading-m\">Protestants</h2>\n<p class=\"govuk-body\">The Baptists founded their own permanent church on the estate in the mid-1950s. Historically, they grew out of the Church of England, with the first congregation in England being established in 1609. There followed centuries of persecution as the established Anglican Church and the state tried to suppress and marginalise them, which left the Baptists with a strong anti-authoritarian streak.</p>\n<p class=\"govuk-body\">The basic tenets of their organised faith hold that the entire congregation, not just the minister, should run the local church, and that the individual church has autonomy within the wider Baptist framework. In particular, Baptists believe that Christianity has to be the choice of the adult, so baptism (that is, entrance into the church) can only be undertaken once the individual is old enough to make a conscious and informed decision.</p>\n<p class=\"govuk-body\">Baptists and Congregationalists played an important role in the garden cities of Letchworth and Welwyn, and they were to play a prominent part in Harold Hill. The two groups found enough similarities to hold religious meetings together in the early years of the estate, but the Baptists split away later to concentrate on building their own church. At the time of purchasing the land on Taunton Road from the LLC for £645, there were 70 Baptist churches in Essex, with the local group on the estate using the Straight Road primary school for services. The hall, opened in September 1954, was built to seat 250 and was named after the late Rev. Hugh McCullough, who had led a team of missionaries called the ‘Essex Five’. At the opening ceremony, the Rev. W.H. Tebbitt said:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘This is a very important day for many of us, and for Harold Hill and the whole great community here.</p>\n  <p class=\"govuk-body\">I hope, too, that this is one of God’s great days, and it is certainly a red-letter day for us. There are a large number of problems but here is now a solid church which is worthy of what it represents. This is our gift to Harold Hill and, more than that, it is our gift to Jesus Christ.’</p>\n</blockquote>\n<h3 class=\"govuk-heading-m\">The Religious Revival</h3>\n<p class=\"govuk-body\">One of the more bizarre stories in Harold Hill’s history was the ‘squashes’ religious revival of 1955. In January of that year the Romford Times ran a front-page article entitled ‘Miracle Story’. It concerned Patricia Letty and her family, who had converted to Christianity after their prayers were answered, although the miracles were hardly of biblical proportions (for example, one involved finding their lost dog).</p>\n<p class=\"govuk-body\">From there grew the ‘squashes’ movement that saw religious meetings held in people’s houses. News of the revival spread around the world and interest was shown in the United States, Australia and Canada.</p>\n<p class=\"govuk-body\">The Romford Times journalist visited a ‘squash’ at a particular house. Forty people, mostly teenagers, had gathered to celebrate their faith. At this ‘squash’, they were informed by a middle-aged woman that she was once a cripple and could hardly walk – even with the aid of sticks – but now God had given her the strength to walk again. The journalist reported:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘There are many meetings such as this on the Harold Hill estate. It is all part of a tremendous religious revival that is taking place there.’</p>\n</blockquote>\n<p class=\"govuk-body\">He observed the liveliness of the ‘squash’:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘It is surprising how happy these meetings are. Everyone sings at the top of their voice, and every now and then there are shouts of “Hallelujah,” which reminds one of the old Negro spirituals.</p>\n  <p class=\"govuk-body\">A blind man is there. He cannot read the words on the hymn sheets, but he taps out the rhythm with his white stick and every now and then joins in a chorus which he is familiar with.</p>\n  <p class=\"govuk-body\">The revival is growing. More and more people are joining the hymn singing and praying.’</p>\n</blockquote>\n<h4 class=\"govuk-heading-m\">Catholics</h4>\n<p class=\"govuk-body\">One of the largest religious communities on Harold Hill were the Catholics, an estimated one in eight to one in seven of the population being of that particular faith. This may indicate that large swathes of the original population were either Irish or had descended from Irish stock, there having been large-scale emigration from Ireland to England for centuries.</p>\n<p class=\"govuk-body\">The early masses took place in the workmen’s canteen of W.C. French – the private company responsible for building the estate. They also took place at Harold Wood hospital and the Plough pub on Gallows Corner, and for the particularly devout there was a weekday 6.30 a.m. service at the priest’s house in Tring Gardens.</p>\n<p class=\"govuk-body\">In 1954, the editor of the Catholic Herald opened Petersfield Avenue’s Church of the Most Holy Redeemer:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘There are no fewer than 2,900 Catholics on the estate, an enormous figure in relation to the population of the parish.’</p>\n</blockquote>\n<p class=\"govuk-body\">Pointing out a higher proportion of Catholics in Harold Hill than elsewhere in the country, he added:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘This suggests that in this new Catholic community the Church has got in on the ground floor.</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">We Catholics have certain beliefs about what is important and these things have formed for over 2,000 years the basis of our civilised community. It seems that in a Catholic community so strong these things can be a great factor for building up a centre.</p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">I know that Protestants are leading good lives, but we have a stronger idea of a good life.’</p>\n</blockquote>\n<p class=\"govuk-body\">Concluding, he said:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘This little gathering at the centre of the estate is beginning history.’</p>\n</blockquote>\n","id":"2hoOOqY5n5SIi5hJTcoMNY"},"__N_SSG":true}