{"pageProps":{"title":"The Glamorous Grandmother – Romford Recorder, 29/03/1957","contentRichText":"\n<article class=\"article\">\n  <p class=\"govuk-body\">Ordinary, hard-working folk live in Gooshays-drive, hub of Harold Hill’s vast LCC estate, but it is these ordinary people – many of whom have a story to tell - who help to bind Harold Hill into a community with a future.</p>\n  <p class=\"govuk-body\">Take, for instance, a depilated shack, which marks many years of voluntary work of Mrs. Ada Campbell for the local RSPCA. Often battling against overwhelming difficulties, she and her band of helpers have saved the lives of many beloved pets.</p>\n  <p class=\"govuk-body\">Now she has taken over larger premises by the health centre, where life’s work continues.</p>\n  <p class=\"govuk-body\">Or look behind the green door of No. 74.</p>\n  <p class=\"govuk-body\">Here, good looks and talent abound for we found it was the home of Harold Hill’s own glamorous grandmother, 47-year-old Mrs. Margaret Sweeney, who last year was runner-up in a holiday camp competition.</p>\n  <p class=\"govuk-body\">But she is not the only celebrity in the household. Her daughter, 11-year-old Maureen, studying at the Italia Conte School of Drama in London, has won several singing competitions, and is well on the way to a career.</p>\n  <p class=\"govuk-body\">With The Band</p>\n  <p class=\"govuk-body\">Someone else in the family has passed the promising stage, Ronnie Chamberlain, Mrs. Sweeney’s nephew, is with Ted Heath’s Band, and is regarded as one of the country’s leading saxophonists.</p>\n  <p class=\"govuk-body\">Undisputed boss of the household is Tuffy, a six-year-old mongrel dog. He was found in a coal cellar and bought by Mrs. Sweeney’s 13-year-old son, Patrick, for half-a-crown.</p>\n  <p class=\"govuk-body\">Since Tuffy came she has produced litters of pups with unfailing regularity, ‘About 50 – all sold,’ said Mrs. Sweeney.</p>\n  <p class=\"govuk-body\">Cries of ‘Vote Labour!’ and ‘Down with the Tories!’ greeted us at number 34. A green budgerigar was the source of the propaganda.</p>\n  <p class=\"govuk-body\">The budgie, Hank, belongs to Councillor Mrs. O.M.J. Roberts, JP, chairman of Romford Education Committee. Needless to say she is a member of the Labour Party.</p>\n  <p class=\"govuk-body\">But Mrs. Roberts was not the bird’s tutor. That was one of her daughters, Julia. She and her sister, Joan, both solicitors’ secretaries, like all kinds of music. ‘It depends which groove you’re in,’ Julia explained.</p>\n  <p class=\"govuk-body\">Carnival Queen</p>\n  <p class=\"govuk-body\">Another daughter, Beryl, is a former Romford Carnival Queen, and Olive teaches languages at an Essex grammar school.</p>\n  <p class=\"govuk-body\">Mrs. Roberts likes popular music. Her favourite recording is Peggy Lee’s Don’t Smoke in Bed. But it has no effect on her husband, Alfred, a detective sergeant in the railway police.</p>\n  <p class=\"govuk-body\">Their son, Terry, six-feet-three, has followed in his father’s footsteps. He is a constable in Essex Constabulary. Beryl and he are twins.</p>\n  <p class=\"govuk-body\">Mrs. Roberts’ family would like to see more entertainment facilities on the estate, but she herself has no time for hobbies. She is lucky to get one free evening a month.</p>\n  <p class=\"govuk-body\">The house of Mr. and Mrs. Joseph Park, No. 94, and the one adjoining, have a special claim to fame. They are the only remaining houses built for farm labourers in the days of Gooshays Manor.</p>\n  <p class=\"govuk-body\">At a Dead End</p>\n  <p class=\"govuk-body\">Mr. Park feels that living in the cottage, his chances of getting a new home are practically nil.</p>\n  <p class=\"govuk-body\">‘I have reached a dead end,’ he said. ‘I wouldn’t mind moving back to my rooms in Bethnal Green, but I must consider the wife and kids.’</p>\n  <p class=\"govuk-body\">His second grouse concerns lack of youth facilities on the estate.</p>\n  <p class=\"govuk-body\">His children are too young for a youth club and Scouts and Cubs have waiting lists. He has been told his children must go to Sunday School if they want to belong to a church club.</p>\n  <p class=\"govuk-body\">Two people who would not move back to their two rooms in Walworth, despite large cracks in the wall of their house at No. 90, are Mr. and Mrs. E.C. Springhall.</p>\n  <p class=\"govuk-body\">The front is a patchwork of unsightly, unhealthy cracks. Daylight streams through the torn walls into the damp and cold front bedroom. Mr. and Mrs. Springhall, who have two girls, aged 10 and two, and a boy of six, have never used the room since moving in four years ago.</p>\n  <p class=\"govuk-body\">Their house and the one next door are trying to part company. No. 88 has a few cracks in the brickwork, but Mr. Springhall’s has suffered badly.</p>\n  <p class=\"govuk-body\">Heard the Cracks</p>\n  <p class=\"govuk-body\">He has heard the walls crack as the gaps widen.</p>\n  <p class=\"govuk-body\">The rear of their house is also affected. Splits from high on the wall reach down to the French windows. Front and back walls are both decorated with LCC ‘tell-tale’ blocks dating back to 1952.</p>\n  <p class=\"govuk-body\">These give the Council an idea how the cracks are creeping. Latest blocks, dated 1954, are split as the gaps continue to increase.</p>\n  <p class=\"govuk-body\">Torn plaster inside the house has often been repaired, but it quickly breaks again. But Mr. Springhall would not leave Harold Hill.</p>\n  <p class=\"govuk-body\">‘It’s a much fuller life here away from the smoky industry,’ he said.</p>\n  <p class=\"govuk-body\">A small clay figure of a policeman stands solemnly in the window of No. 14. Nothing could be more apt. Perhaps the most famous policeman in the Essex Constabulary lives here.</p>\n  <p class=\"govuk-body\">Sergeant Walter Liddiatt, 21 years in the force, is remarkable as the only bearded policeman in Essex. His fine red whiskers have become part-and-parcel of Harold Hill.</p>\n</article>\n<hr>\n<p class=\"govuk-body\">Providing another illumination on past outlooks, but from a different angle, are these extracts taken from essays written by 13- and 14-year-old pupils of Quarles Girls’ Secondary School in 1959:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘Our teacher… says she thinks that Harold Hill is the nicest estate she has ever seen because of the lovely scenery, modern architecture, new modern schools, new and up-to-date houses. In one word the whole estate is having more and more things added to it which are MODERN.</p>\n  <p class=\"govuk-body\">The houses are respectable along with the people who live in them. They are clean and fresh and are decorated often.</p>\n  <p class=\"govuk-body\">Harold Hill Estate will soon be fit for a Queen to live in as it has every means of near transport.</p>\n  <p class=\"govuk-body\">\n    And one thing that must be stressed is the amusements that will surely come into development for the younger generation.’\n    – Gloria Johnson\n  </p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">‘I remember how thrilled I was at having my own bedroom, and how big I thought it was. Then my mother found the immersion heater, so now instead of boiling kettles of water we could just turn on the switch and within half-an-hour or so we have boiling water for a bath. Then we saw the cupboards in the kitchen all along one side of the wall.</p>\n  <p class=\"govuk-body\">\n    “It was a present from heaven,” as my mother said.’\n    – Carol Watts\n  </p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">\n    ‘Our house seemed like heaven – tiled bathroom with a wash basin, separate toilet, and hot and cold running water – only to mention a few of the luxuries.’\n    – Barbara Sheppard\n  </p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">\n    ‘The advantages were, we had hot water in the taps and a garden to grow flowers, vegetables and to play in. Where as in London you only had a yard and no hot water.’\n    – Helen Murdoch\n  </p>\n</blockquote>\n<blockquote>\n  <p class=\"govuk-body\">\n    ‘I like the housing estates with their gardens, especially these big wonderful schools. When I was at Pitsea I went to an old school not half as nice as this one and when I used to tell the girls what it was like they couldn’t believe it and wished they could come here.’1\n    – Marie Pottle\n  </p>\n</blockquote>\n","id":"443YEnbnu4o5qI0JTdkQtn"},"__N_SSG":true}