{"pageProps":{"title":"The Conservatives Start Selling Council Houses","contentRichText":"\n<p class=\"govuk-body\">The Right to Buy, as enshrined in the Housing Act 1980, was one of the biggest factors in changing Harold Hill after it was built in the 1950s. The change has been irreversible, though whether that is beneficial or detrimental to the community is a debate that still continues today.</p>\n<p class=\"govuk-body\">Harold Hill started as a completely council-owned housing estate – that is, the landlord was the municipal government, which was initially the LCC, then the GLC, and then, later, the London Borough of Havering.</p>\n<p class=\"govuk-body\">Since 1967, but with a particular increase from 1980, tenants have bought their own homes. This has left council-owned properties in the minority in Harold Hill.</p>\n<p class=\"govuk-body\">The effects of this have made a fundamental difference, as former Labour councillors Dennis Cook and Del Smith note:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘The vast change has been the Right to Buy that transformed vast rows of industrial rabbit hutches because people started to improve the front of their houses. The fronts of people’s houses were revolutionised by the Right to Buy – the place was transformed. I know people who voted Tory because they wanted to buy their house. They voted Tory just the once, bought their house, and that was that. A lot of people did that and I can understand it because working class people had sod all. For decades past they had worked all their lives and after sixty or seventy years most of them had never even bothered to write a will. What would be the point with accumulated wealth of a few bits of furniture and a Sunday suit? Then all of a sudden somebody comes along and says, “I’ll give you half a house.” If you are going to give away money then obviously people will take it and say, “Thank you very much.” And they did. Almost all of my friends and family started to buy their council houses at that time.’</p>\n</blockquote>\n<p class=\"govuk-body\">Del Smith’s comment about giving money away is a reference to the massive discounts that were made available to tenants. From 1980 onwards, tenants could expect to receive generous double-digit percentage discounts on the market values of their properties.</p>\n<h2 class=\"govuk-heading-m\">Conservatism and home-ownership</h2>\n<p class=\"govuk-body\">Attempts were made by various Conservative local authorities to sell council houses after the end of the Second World War.</p>\n<p class=\"govuk-body\">Hornchurch County Council attempted to sell its council homes in the early 1950s, but only managed to sell six.</p>\n<p class=\"govuk-body\">Beyond Havering, in 1967, Francis Frederick Griffin, the leader of the Tory council in Birmingham, published an influential pamphlet, Selling Council Houses. Based on the experiences of Conservative rule in Birmingham, it was reprinted several times and eagerly read by a generation of Tory Town Hall activists.</p>\n<p class=\"govuk-body\">As Griffin wrote, their policy was based on the belief that government, both local and national, should have as little to do with people’s lives as possible:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘We (the Tory council) determined that it was the function of the local authority to serve the people, not master them… We decided that the vital principle of local government was to interfere as little as possible rather than as much as would be tolerated.’</p>\n</blockquote>\n<p class=\"govuk-body\">After seven months in power, they had sold 2,101 homes. This included a reduction in cost of up to 10 per cent for long-term residents.</p>\n<h3 class=\"govuk-heading-m\">Tories take control of the LCC</h3>\n<p class=\"govuk-body\">When the Tories gained control of the GLC in 1967 they cut subsidies to council houses, forcing rents to be increased dramatically, but they also embarked on a path to allow tenants to buy the homes they were renting.</p>\n<p class=\"govuk-body\">The first person in London to buy his council house was 44-year-old James Regan of Sheffield Drive, Harold Hill. He had moved to the estate from Stepney in 1953 and had lived in Sheffield Drive since 1958.</p>\n<p class=\"govuk-body\">Earning £1,500 a year working for the London Electricity Board, he bought his house for £3,060, having been granted a 10 per cent discount because of the number of years he had lived there. Instead of paying the inclusive rent of £3 12s, he put down a £60 deposit and was prepared to pay £4 7s per week. As Mr Regan had spent £1,000 on modifications to the house since living there, he considered it a worthwhile purchase.</p>\n<p class=\"govuk-body\">Desmond Plummer, the leader of the GLC, ceremoniously handed over a golden key to the new owner on 4 October 1967.</p>\n<p class=\"govuk-body\">James Regan gladly accepted and, furthermore, resigned as a member of the Labour Party at the same time:</p>\n<blockquote>\n  <p class=\"govuk-body\">‘I’ve been 20 years a member and 30 years a supporter… My thinking is still along socialist lines, but I’ve resigned because there’s so much local Labour hostility to council house sales.</p>\n  <p class=\"govuk-body\">It works out £2 extra to own this piece of England.</p>\n  <p class=\"govuk-body\">I’ve been a strong socialist since the thirties, but I see no wrong in buying my own home just because the council built it.’</p>\n</blockquote>\n<p class=\"govuk-body\">Also in attendance on that day was Horace Cutler, the Tory Chair of the GLC Housing Committee, who had previously said: ‘Are council houses really necessary any more? In my opinion, no. I believe that local authorities should get out of housing altogether.’</p>\n<p class=\"govuk-body\">Obviously, Horace Cutler saw James Regan as part of his vision.</p>\n<p class=\"govuk-body\">By 1970, the then Conservative national government allowed local authorities to give discounts of up to 20 per cent to sell their houses. But, as with all these schemes, there were restrictions. For instance, Birmingham Council never allowed more than 10 per cent of its housing stock in any particular area to be sold.</p>\n","id":"1LtdBP9IpzjGWOAb0kyeuV"},"__N_SSG":true}